import { ndnDice } from "../commands/utils/dice.mjs"

const weapons = [
{
   "name": "24式張替傘・乙",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "ウルトラチャクチ"
},
{
   "name": "ワイドローラー",
   "type": "ローラー",
   "sub": "スプラッシュシールド",
   "special": "キューインキ"
},
{
   "name": "R-PEN/5H",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "スパイガジェット",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "サメライド"
},
{
   "name": "キャンピングシェルター",
   "type": "シェルター",
   "sub": "ジャンプビーコン",
   "special": "キューインキ"
},
{
   "name": "もみじシューター",
   "type": "シューター",
   "sub": "トーピード",
   "special": "ホップソナー"
},
{
   "name": "14式竹筒銃・乙",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
},
{
   "name": "スプラマニューバーコラボ",
   "type": "マニューバー",
   "sub": "カーリングボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "ジムワイパー",
   "type": "ワイパー",
   "sub": "クイックボム",
   "special": "ショクワンダー"
},
{
   "name": "LACT-450デコ",
   "type": "ストリンガー",
   "sub": "スプラッシュシールド",
   "special": "サメライド"
},
{
   "name": "クアッドホッパーホワイト",
   "type": "マニューバー",
   "sub": "スプリンクラー",
   "special": "ショクワンダー"
},
{
   "name": "ロングブラスターカスタム",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "テイオウイカ"
},
{
   "name": "カーボンローラーデコ",
   "type": "ローラー",
   "sub": "クイックボム",
   "special": "ウルトラショット"
},
{
   "name": "デンタルワイパースミ",
   "type": "ワイパー",
   "sub": "スプラッシュシールド",
   "special": "ジェットパック"
},
{
   "name": "ガエンFFカスタム",
   "type": "マニューバー",
   "sub": "クイックボム",
   "special": "トリプルトルネード"
},
{
   "name": "プロモデラーRG(金モデ)",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "ナイスダマ"
},
{
   "name": "スプラシューター",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ウルトラショット"
},
{
   "name": "ガエンFF",
   "type": "マニューバー",
   "sub": "トラップ",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "プロモデラーMG(銀モデ)",
   "type": "シューター",
   "sub": "タンサンボム",
   "special": "サメライド"
},
{
   "name": "スプラローラー",
   "type": "ローラー",
   "sub": "カーリングボム",
   "special": "グレートバリア"
},
{
   "name": "クラッシュブラスターネオ",
   "type": "ブラスター",
   "sub": "カーリングボム",
   "special": "デコイチラシ"
},
{
   "name": "ラピッドブラスターデコ",
   "type": "ブラスター",
   "sub": "トーピード",
   "special": "ジェットパック"
},
{
   "name": "ヒッセン",
   "type": "スロッシャー",
   "sub": "ポイズンミスト",
   "special": "ジェットパック"
},
{
   "name": "リッター4K or スコープ",
   "type": "チャージャー",
   "sub": "トラップ",
   "special": "ホップソナー"
},
{
   "name": ".52ガロンデコ",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "スミナガシート"
},
{
   "name": "スプラスピナー",
   "type": "スピナー",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "スプラチャージャーコラボ or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "トリプルトルネード"
},
{
   "name": "スプラシューターコラボ",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "スクリュースロッシャー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "ナイスダマ"
},
{
   "name": "ヴァリアブルローラー",
   "type": "ローラー",
   "sub": "トラップ",
   "special": "マルチミサイル"
},
{
   "name": "ホットブラスターカスタム",
   "type": "ブラスター",
   "sub": "ポイントセンサー",
   "special": "ウルトラチャクチ"
},
{
   "name": "デュアルスイーパー",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "ホップソナー"
},
{
   "name": "スプラマニューバー",
   "type": "マニューバー",
   "sub": "キューバンボム",
   "special": "カニタンク"
},
{
   "name": "N-ZAP89(赤ザップ)",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "デコイチラシ"
},
{
   "name": "スクイックリンα",
   "type": "チャージャー",
   "sub": "ポイントセンサー",
   "special": "グレートバリア"
},
{
   "name": "H3リールガン",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "エナジースタンド"
},
{
   "name": "リッター4Kカスタム or スコープ",
   "type": "チャージャー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "ソイチューバーカスタム",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "カーボンローラー",
   "type": "ローラー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": ".52ガロン",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "オーバーフロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "テイオウイカ"
},
{
   "name": "ボトルガイザー",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
},
{
   "name": "シャープマーカー",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "カニタンク"
},
{
   "name": ".96ガロン",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "キューインキ"
},
{
   "name": "イグザミナー・ヒュー",
   "type": "スピナー",
   "sub": "スプラッシュボム",
   "special": "カニタンク"
},
{
   "name": "ボールドマーカーネオ",
   "type": "シューター",
   "sub": "ジャンプビーコン",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ドライブワイパー",
   "type": "ワイパー",
   "sub": "トーピード",
   "special": "ウルトラハンコ"
},
{
   "name": "スパイガジェットソレーラ",
   "type": "シェルター",
   "sub": "トーピード",
   "special": "スミナガシート"
},
{
   "name": "モップリン",
   "type": "スロッシャー",
   "sub": "キューバンボム",
   "special": "サメライド"
},
{
   "name": "ハイドラント",
   "type": "スピナー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
},
{
   "name": "クーゲルシュライバー・ヒュー",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "キューインキ"
},
{
   "name": "ヴァリアブルローラーフォイル",
   "type": "ローラー",
   "sub": "キューバンボム",
   "special": "スミナガシート"
},
{
   "name": "クーゲルシュライバー",
   "type": "スピナー",
   "sub": "タンサンボム",
   "special": "ジェットパック"
},
{
   "name": "クアッドホッパーブラック",
   "type": "マニューバー",
   "sub": "ロボットボム",
   "special": "サメライド"
},
{
   "name": "S-BLAST91(亜種)",
   "type": "ブラスター",
   "sub": "クイックボム",
   "special": "ナイスダマ"
},
{
   "name": "バケットスロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "ショクワンダー"
},
{
   "name": "ジェットスイーパー",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "キューインキ"
},
{
   "name": "Rブラスターエリートデコ",
   "type": "ブラスター",
   "sub": "ラインマーカー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "パブロ",
   "type": "フデ",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ソイチューバー",
   "type": "チャージャー",
   "sub": "トーピード",
   "special": "マルチミサイル"
},
{
   "name": "ハイドラントカスタム",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "スミナガシート"
},
{
   "name": "パブロ・ヒュー",
   "type": "フデ",
   "sub": "トラップ",
   "special": "ウルトラハンコ"
},
{
   "name": "ケルビン525",
   "type": "マニューバー",
   "sub": "スプラッシュシールド",
   "special": "ナイスダマ"
},
{
   "name": "フィンセント・ヒュー",
   "type": "フデ",
   "sub": "ポイントセンサー",
   "special": "マルチミサイル"
},
{
   "name": "イグザミナー",
   "type": "スピナー",
   "sub": "カーリングボム",
   "special": "エナジースタンド"
},
{
   "name": "デュアルスイーパーカスタム",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "デコイチラシ"
},
{
   "name": "パラシェルターソレーラ",
   "type": "シェルター",
   "sub": "ロボットボム",
   "special": "ジェットパック"
},
{
   "name": "Rブラスターエリート",
   "type": "ブラスター",
   "sub": "ポイズンミスト",
   "special": "キューインキ"
},
{
   "name": "ノーチラス47",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "キャンピングシェルターソレーラ",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "ウルトラショット"
},
{
   "name": "24式張替傘・甲",
   "type": "シェルター",
   "sub": "ラインマーカー",
   "special": "グレートバリア"
},
{
   "name": "エクスプロッシャー",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "R-PEN/5B",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "アメフラシ"
},
{
   "name": "ラピッドブラスター",
   "type": "ブラスター",
   "sub": "トラップ",
   "special": "トリプルトルネード"
},
{
   "name": "クラッシュブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ウルトラショット"
},
{
   "name": "ジムワイパー・ヒュー",
   "type": "ワイパー",
   "sub": "ポイズンミスト",
   "special": "カニタンク"
},
{
   "name": "スプラチャージャー or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュボム",
   "special": "キューインキ"
},
{
   "name": "ボトルガイザーフォイル",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "スミナガシート"
},
{
   "name": "スプラローラーコラボ",
   "type": "ローラー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "デンタルワイパーミント",
   "type": "ワイパー",
   "sub": "キューバンボム",
   "special": "グレートバリア"
},
{
   "name": "14式竹筒銃・甲",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ホットブラスター",
   "type": "ブラスター",
   "sub": "ロボットボム",
   "special": "グレートバリア"
},
{
   "name": "ボールドマーカー",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "ウルトラハンコ"
},
{
   "name": "プライムシューターコラボ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ナイスダマ"
},
{
   "name": "ワイドローラーコラボ",
   "type": "ローラー",
   "sub": "ラインマーカー",
   "special": "アメフラシ"
},
{
   "name": "スパッタリー・ヒュー(青スパ)",
   "type": "マニューバー",
   "sub": "トーピード",
   "special": "サメライド"
},
{
   "name": "スペースシューター",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "バレルスピナー",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "ホップソナー"
},
{
   "name": "ドライブワイパーデコ",
   "type": "ワイパー",
   "sub": "ジャンプビーコン",
   "special": "マルチミサイル"
},
{
   "name": "ダイナモローラー",
   "type": "ローラー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "L3リールガンD",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "スプラスピナーコラボ",
   "type": "スピナー",
   "sub": "ポイズンミスト",
   "special": "グレートバリア"
},
{
   "name": ".96ガロンデコ",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "テイオウイカ"
},
{
   "name": "L3リールガン",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "カニタンク"
},
{
   "name": "スクイックリンβ",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "トライストリンガーコラボ",
   "type": "ストリンガー",
   "sub": "スプリンクラー",
   "special": "デコイチラシ"
},
{
   "name": "ヒッセン・ヒュー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "エナジースタンド"
},
{
   "name": "エクスプロッシャーカスタム",
   "type": "スロッシャー",
   "sub": "スプラッシュシールド",
   "special": "ウルトラチャクチ"
},
{
   "name": "シャープマーカーネオ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
},
{
   "name": "N-ZAP85(黒ザップ)",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
},
{
   "name": "H3リールガンD",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "グレートバリア"
},
{
   "name": "ロングブラスター",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "ホップソナー"
},
{
   "name": "ノーチラス79(金ノチ)",
   "type": "スピナー",
   "sub": "キューバンボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "フルイドVカスタム",
   "type": "ストリンガー",
   "sub": "ポイントセンサー",
   "special": "ホップソナー"
},
{
   "name": "バレルスピナーデコ",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "テイオウイカ"
},
{
   "name": "ケルビン525デコ",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "ノヴァブラスターネオ",
   "type": "ブラスター",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ノヴァブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ショクワンダー"
},
{
   "name": "プライムシューター",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "カニタンク"
},
{
   "name": "バケットスロッシャー",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "モップリンD",
   "type": "スロッシャー",
   "sub": "ジャンプビーコン",
   "special": "ホップソナー"
},
{
   "name": "オーバーフロッシャー",
   "type": "スロッシャー",
   "sub": "スプリンクラー",
   "special": "アメフラシ"
},
{
   "name": "ジェットスイーパーカスタム",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
},
{
   "name": "フィンセント",
   "type": "フデ",
   "sub": "カーリングボム",
   "special": "ホップソナー"
},
{
   "name": "スペースシューターコラボ",
   "type": "シューター",
   "sub": "トラップ",
   "special": "ジェットパック"
},
{
   "name": "LACT-450",
   "type": "ストリンガー",
   "sub": "カーリングボム",
   "special": "マルチミサイル"
},
{
   "name": "フルイドV",
   "type": "ストリンガー",
   "sub": "ロボットボム",
   "special": "ウルトラハンコ"
},
{
   "name": "パラシェルター",
   "type": "シェルター",
   "sub": "スプリンクラー",
   "special": "トリプルトルネード"
},
{
   "name": "ホクサイ",
   "type": "フデ",
   "sub": "キューバンボム",
   "special": "ショクワンダー"
},
{
   "name": "ホクサイ・ヒュー",
   "type": "フデ",
   "sub": "ジャンプビーコン",
   "special": "アメフラシ"
},
{
   "name": "スクリュースロッシャーネオ",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "スパッタリー(赤スパ)",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "エナジースタンド"
},
{
   "name": "わかばシューター",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "グレートバリア"
},
{
   "name": "ダイナモローラーテスラ",
   "type": "ローラー",
   "sub": "スプラッシュボム",
   "special": "デコイチラシ"
},
{
   "name": "トライストリンガー",
   "type": "ストリンガー",
   "sub": "ポイズンミスト",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "S-BLAST92(通常)",
   "type": "ブラスター",
   "sub": "スプリンクラー",
   "special": "サメライド"
},
   {
   "name": "スプラシューター煌",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "テイオウイカ"
 },
 {
   "name": ".96ガロン爪",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "エナジースタンド"
 },
 {
   "name": "プロモデラー彩",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "スミナガシート"
 },
 {
   "name": "L3リールガン箔",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "ジェットパック"
 },
 {
   "name": "モップリン角",
   "type": "スロッシャー",
   "sub": "カーリングボム",
   "special": "カニタンク"
 },
 {
   "name": "ダイナモローラー冥",
   "type": "ローラー",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "ワイドローラー惑",
   "type": "ローラー",
   "sub": "トーピード",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "ハイドラント圧",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "グレートバリア"
 },
 {
   "name": "スプラマニューバー耀",
   "type": "マニューバー",
   "sub": "タンサンボム",
   "special": "グレートバリア"
 },
 {
   "name": "デュアルスイーパー蹄",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "スミナガシート"
 },
 {
   "name": "スパイガジェット繚",
   "type": "シェルター",
   "sub": "カーリングボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "ホットブラスター艶",
   "type": "ブラスター",
   "sub": "ジャンプビーコン",
   "special": "カニタンク"
 },
 {
   "name": "ホクサイ彗",
   "type": "フデ",
   "sub": "ロボットボム",
   "special": "テイオウイカ"
 },
 {
   "name": "トライストリンガー燈",
   "type": "ストリンガー",
   "sub": "ラインマーカー",
   "special": "ジェットパック"
 },
 {
   "name": "ジムワイパー封",
   "type": "ワイパー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
 },
 {
   "name": "シャープマーカーGECK",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
 },
 {
   "name": "プライムシューターFRZN",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "マルチミサイル"
 },
 {
   "name": "ジェットスイーパーCOBR",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "H3リールガンSNAK",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
 },
 {
   "name": "ヒッセンASH",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "スミナガシート"
 },
 {
   "name": "カーボンローラーANGL",
   "type": "ローラー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
 },
 {
   "name": "スプラチャージャーFRSTorスコープ",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "カニタンク"
 },
 {
   "name": "スプラスピナーPYTN",
   "type": "スピナー",
   "sub": "ジャンプビーコン",
   "special": "ウルトラショット"
 },
 {
   "name": "スパッタリーOWL",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "キャンピングシェルターCREM",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "デコイチラシ"
 },
 {
   "name": "RブラスターエリートWNTR",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
 },
 {
   "name": "フィンセントBRNZ",
   "type": "フデ",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
 },
 {
   "name": "LACT-450MILK",
   "type": "ストリンガー",
   "sub": "トーピード",
   "special": "ナイスダマ"
 },
 {
   "name": "ドライブワイパーRUST",
   "type": "ワイパー",
   "sub": "カーリングボム",
   "special": "ウルトラショット"
 }
];
const main = [
 {
   "name": "ボールドマーカー",
   "name2": "ボールドマーカーネオ",
   "name3": "-",
   "type": "シューター",
   "sub1": "カーリングボム",
   "sub2": "ジャンプビーコン",
   "sub3": "-",
   "special1": "ウルトラハンコ",
   "special2": "メガホンレーザー5.1ch",
   "special3": "-"
 },
 {
   "name": "わかばシューター",
   "name2": "もみじシューター",
   "name3": "-",
   "type": "シューター",
   "sub1": "スプラッシュボム",
   "sub2": "トーピード",
   "sub3": "-",
   "special1": "グレートバリア",
   "special2": "ホップソナー",
   "special3": "-"
 },
 {
   "name": "シャープマーカー",
   "name2": "シャープマーカーネオ",
   "name3": "シャープマーカーGECK",
   "type": "シューター",
   "sub1": "クイックボム",
   "sub2": "キューバンボム",
   "sub3": "ポイズンミスト",
   "special1": "カニタンク",
   "special2": "トリプルトルネード",
   "special3": "アメフラシ"
 },
 {
   "name": "プロモデラーMG(銀モデ)",
   "name2": "プロモデラーRG(金モデ)",
   "name3": "プロモデラー彩",
   "type": "シューター",
   "sub1": "タンサンボム",
   "sub2": "スプリンクラー",
   "sub3": "クイックボム",
   "special1": "サメライド",
   "special2": "ナイスダマ",
   "special3": "スミナガシート"
 },
 {
   "name": "スプラシューター",
   "name2": "スプラシューターコラボ",
   "name3": "スプラシューター煌",
   "type": "シューター",
   "sub1": "キューバンボム",
   "sub2": "スプラッシュボム",
   "sub3": "クイックボム",
   "special1": "ウルトラショット",
   "special2": "トリプルトルネード",
   "special3": "テイオウイカ"
 },
 {
   "name": ".52ガロン",
   "name2": ".52ガロンデコ",
   "name3": "-",
   "type": "シューター",
   "sub1": "スプラッシュシールド",
   "sub2": "カーリングボム",
   "sub3": "-",
   "special1": "メガホンレーザー5.1ch",
   "special2": "スミナガシート",
   "special3": "-"
 },
 {
   "name": "N-ZAP85(黒ZAP)",
   "name2": "N-ZAP89(赤ZAP)",
   "name3": "-",
   "type": "シューター",
   "sub1": "キューバンボム",
   "sub2": "ロボットボム",
   "sub3": "-",
   "special1": "エナジースタンド",
   "special2": "デコイチラシ",
   "special3": "-"
 },
 {
   "name": "プライムシューター",
   "name2": "プライムシューターコラボ",
   "name3": "プライムシューターFRZN",
   "type": "シューター",
   "sub1": "ラインマーカー",
   "sub2": "キューバンボム",
   "sub3": "スプラッシュボム",
   "special1": "カニタンク",
   "special2": "ナイスダマ",
   "special3": "マルチミサイル"
 },
 {
   "name": ".96ガロン",
   "name2": ".96ガロンデコ",
   "name3": ".96ガロン爪",
   "type": "シューター",
   "sub1": "スプリンクラー",
   "sub2": "スプラッシュシールド",
   "sub3": "ラインマーカー",
   "special1": "キューインキ",
   "special2": "テイオウイカ",
   "special3": "エナジースタンド"
 },
 {
   "name": "ジェットスイーパー",
   "name2": "ジェットスイーパーカスタム",
   "name3": "ジェットスイーパーCOBR",
   "type": "シューター",
   "sub1": "ラインマーカー",
   "sub2": "ポイズンミスト",
   "sub3": "クイックボム",
   "special1": "キューインキ",
   "special2": "アメフラシ",
   "special3": "ウルトラチャクチ"
 },
 {
   "name": "スペースシューター",
   "name2": "スペースシューターコラボ",
   "name3": "-",
   "type": "シューター",
   "sub1": "ポイントセンサー",
   "sub2": "トラップ",
   "sub3": "-",
   "special1": "メガホンレーザー5.1ch",
   "special2": "ジェットパック",
   "special3": "-"
 },
 {
   "name": "L3リールガン",
   "name2": "L3リールガンD",
   "name3": "L3リールガン箔",
   "type": "シューター",
   "sub1": "カーリングボム",
   "sub2": "クイックボム",
   "sub3": "スプラッシュボム",
   "special1": "カニタンク",
   "special2": "ウルトラハンコ",
   "special3": "ジェットパック"
 },
 {
   "name": "H3リールガン",
   "name2": "H3リールガンD",
   "name3": "H3リールガンSNAK",
   "type": "シューター",
   "sub1": "ポイントセンサー",
   "sub2": "スプラッシュシールド",
   "sub3": "キューバンボム",
   "special1": "エナジースタンド",
   "special2": "グレートバリア",
   "special3": "トリプルトルネード"
 },
 {
   "name": "ボトルガイザー",
   "name2": "ボトルガイザーフォイル",
   "name3": "-",
   "type": "シューター",
   "sub1": "スプラッシュシールド",
   "sub2": "ロボットボム",
   "sub3": "-",
   "special1": "ウルトラショット",
   "special2": "スミナガシート",
   "special3": "-"
 },
 {
   "name": "カーボンローラー",
   "name2": "カーボンローラーデコ",
   "name3": "カーボンローラーANGL",
   "type": "ローラー",
   "sub1": "ロボットボム",
   "sub2": "クイックボム",
   "sub3": "タンサンボム",
   "special1": "ショクワンダー",
   "special2": "ウルトラショット",
   "special3": "デコイチラシ"
 },
 {
   "name": "スプラローラー",
   "name2": "スプラローラーコラボ",
   "name3": "-",
   "type": "ローラー",
   "sub1": "カーリングボム",
   "sub2": "ジャンプビーコン",
   "sub3": "-",
   "special1": "グレートバリア",
   "special2": "テイオウイカ",
   "special3": "-"
 },
 {
   "name": "ダイナモローラー",
   "name2": "ダイナモローラーテスラ",
   "name3": "ダイナモローラー冥",
   "type": "ローラー",
   "sub1": "スプリンクラー",
   "sub2": "スプラッシュボム",
   "sub3": "ポイントセンサー",
   "special1": "エナジースタンド",
   "special2": "デコイチラシ",
   "special3": "メガホンレーザー5.1ch"
 },
 {
   "name": "ヴァリアブルローラー",
   "name2": "ヴァリアブルローラーフォイル",
   "name3": "-",
   "type": "ローラー",
   "sub1": "トラップ",
   "sub2": "キューバンボム",
   "sub3": "-",
   "special1": "マルチミサイル",
   "special2": "スミナガシート",
   "special3": "-"
 },
 {
   "name": "ワイドローラー",
   "name2": "ワイドローラーコラボ",
   "name3": "ワイドローラー惑",
   "type": "ローラー",
   "sub1": "スプラッシュシールド",
   "sub2": "ラインマーカー",
   "sub3": "トーピード",
   "special1": "キューインキ",
   "special2": "アメフラシ",
   "special3": "ウルトラチャクチ"
 },
 {
   "name": "スクイックリンα",
   "name2": "スクイックリンβ",
   "name3": "-",
   "type": "チャージャー",
   "sub1": "ポイントセンサー",
   "sub2": "ロボットボム",
   "sub3": "-",
   "special1": "グレートバリア",
   "special2": "ショクワンダー",
   "special3": "-"
 },
 {
   "name": "スプラチャージャー or スコープ",
   "name2": "スプラチャージャーコラボ or スコープ",
   "name3": "スプラチャージャーFRST or スコープ",
   "type": "チャージャー",
   "sub1": "スプラッシュボム",
   "sub2": "スプラッシュシールド",
   "sub3": "スプリンクラー",
   "special1": "キューインキ",
   "special2": "トリプルトルネード",
   "special3": "カニタンク"
 },
 {
   "name": "リッター4K or スコープ",
   "name2": "リッター4Kカスタム or スコープ",
   "name3": "-",
   "type": "チャージャー",
   "sub1": "トラップ",
   "sub2": "ジャンプビーコン",
   "sub3": "-",
   "special1": "ホップソナー",
   "special2": "テイオウイカ",
   "special3": "-"
 },
 {
   "name": "14式竹筒銃・甲",
   "name2": "14式竹筒銃・乙",
   "name3": "-",
   "type": "チャージャー",
   "sub1": "ロボットボム",
   "sub2": "タンサンボム",
   "sub3": "-",
   "special1": "メガホンレーザー5.1ch",
   "special2": "デコイチラシ",
   "special3": "-"
 },
 {
   "name": "ソイチューバー",
   "name2": "ソイチューバーカスタム",
   "name3": "-",
   "type": "チャージャー",
   "sub1": "トーピード",
   "sub2": "タンサンボム",
   "sub3": "-",
   "special1": "マルチミサイル",
   "special2": "ウルトラハンコ",
   "special3": "-"
 },
 {
   "name": "R-PEN/5H",
   "name2": "R-PEN/5B",
   "name3": "-",
   "type": "チャージャー",
   "sub1": "スプリンクラー",
   "sub2": "スプラッシュシールド",
   "sub3": "-",
   "special1": "エナジースタンド",
   "special2": "アメフラシ",
   "special3": "-"
 },
 {
   "name": "バケットスロッシャー",
   "name2": "バケットスロッシャーデコ",
   "name3": "-",
   "type": "スロッシャー",
   "sub1": "スプラッシュボム",
   "sub2": "ラインマーカー",
   "sub3": "-",
   "special1": "トリプルトルネード",
   "special2": "ショクワンダー",
   "special3": "-"
 },
 {
   "name": "ヒッセン",
   "name2": "ヒッセン・ヒュー",
   "name3": "ヒッセンASH",
   "type": "スロッシャー",
   "sub1": "ポイズンミスト",
   "sub2": "タンサンボム",
   "sub3": "スプラッシュボム",
   "special1": "ジェットパック",
   "special2": "エナジースタンド",
   "special3": "スミナガシート"
 },
 {
   "name": "スクリュースロッシャー",
   "name2": "スクリュースロッシャーネオ",
   "name3": "-",
   "type": "スロッシャー",
   "sub1": "タンサンボム",
   "sub2": "ポイントセンサー",
   "sub3": "-",
   "special1": "ナイスダマ",
   "special2": "ウルトラショット",
   "special3": "-"
 },
 {
   "name": "オーバーフロッシャー",
   "name2": "オーバーフロッシャーデコ",
   "name3": "-",
   "type": "スロッシャー",
   "sub1": "スプリンクラー",
   "sub2": "ラインマーカー",
   "sub3": "-",
   "special1": "アメフラシ",
   "special2": "テイオウイカ",
   "special3": "-"
 },
 {
   "name": "エクスプロッシャー",
   "name2": "エクスプロッシャーカスタム",
   "name3": "-",
   "type": "スロッシャー",
   "sub1": "ポイントセンサー",
   "sub2": "スプラッシュシールド",
   "sub3": "-",
   "special1": "アメフラシ",
   "special2": "ウルトラチャクチ",
   "special3": "-"
 },
 {
   "name": "モップリン",
   "name2": "モップリンD",
   "name3": "モップリン角",
   "type": "スロッシャー",
   "sub1": "キューバンボム",
   "sub2": "ジャンプビーコン",
   "sub3": "カーリングボム",
   "special1": "サメライド",
   "special2": "ホップソナー",
   "special3": "カニタンク"
 },
 {
   "name": "スプラスピナー",
   "name2": "スプラスピナーコラボ",
   "name3": "スプラスピナーPYTN",
   "type": "スピナー",
   "sub1": "クイックボム",
   "sub2": "ポイズンミスト",
   "sub3": "ジャンプビーコン",
   "special1": "ウルトラハンコ",
   "special2": "グレートバリア",
   "special3": "ウルトラショット"
 },
 {
   "name": "バレルスピナー",
   "name2": "バレルスピナーデコ",
   "name3": "-",
   "type": "スピナー",
   "sub1": "スプリンクラー",
   "sub2": "ポイントセンサー",
   "sub3": "-",
   "special1": "ホップソナー",
   "special2": "テイオウイカ",
   "special3": "-"
 },
 {
   "name": "ハイドラント",
   "name2": "ハイドラントカスタム",
   "name3": "ハイドラント圧",
   "type": "スピナー",
   "sub1": "ロボットボム",
   "sub2": "トラップ",
   "sub3": "スプリンクラー",
   "special1": "ナイスダマ",
   "special2": "スミナガシート",
   "special3": "グレートバリア"
 },
 {
   "name": "クーゲルシュライバー",
   "name2": "クーゲルシュライバー・ヒュー",
   "name3": "-",
   "type": "スピナー",
   "sub1": "タンサンボム",
   "sub2": "トラップ",
   "sub3": "-",
   "special1": "ジェットパック",
   "special2": "キューインキ",
   "special3": "-"
 },
 {
   "name": "ノーチラス47",
   "name2": "ノーチラス79(金ノチ)",
   "name3": "-",
   "type": "スピナー",
   "sub1": "ポイントセンサー",
   "sub2": "キューバンボム",
   "sub3": "-",
   "special1": "アメフラシ",
   "special2": "ウルトラチャクチ",
   "special3": "-"
 },
 {
   "name": "イグザミナー",
   "name2": "イグザミナー・ヒュー",
   "name3": "-",
   "type": "スピナー",
   "sub1": "カーリングボム",
   "sub2": "スプラッシュボム",
   "sub3": "-",
   "special1": "エナジースタンド",
   "special2": "カニタンク",
   "special3": "-"
 },
 {
   "name": "スパッタリー",
   "name2": "スパッタリー・ヒュー",
   "name3": "スパッタリーOWL",
   "type": "マニューバー",
   "sub1": "ジャンプビーコン",
   "sub2": "トーピード",
   "sub3": "スプラッシュボム",
   "special1": "エナジースタンド",
   "special2": "サメライド",
   "special3": "メガホンレーザー5.1ch"
 },
 {
   "name": "スプラマニューバー",
   "name2": "スプラマニューバーコラボ",
   "name3": "スプラマニューバー耀",
   "type": "マニューバー",
   "sub1": "キューバンボム",
   "sub2": "カーリングボム",
   "sub3": "タンサンボム",
   "special1": "カニタンク",
   "special2": "ウルトラチャクチ",
   "special3": "グレートバリア"
 },
 {
   "name": "ケルビン525",
   "name2": "ケルビン525デコ",
   "name3": "-",
   "type": "マニューバー",
   "sub1": "スプラッシュシールド",
   "sub2": "ポイントセンサー",
   "sub3": "-",
   "special1": "ナイスダマ",
   "special2": "ウルトラショット",
   "special3": "-"
 },
 {
   "name": "デュアルスイーパー",
   "name2": "デュアルスイーパーカスタム",
   "name3": "デュアルスイーパー蹄",
   "type": "マニューバー",
   "sub1": "スプラッシュボム",
   "sub2": "ジャンプビーコン",
   "sub3": "ポイントセンサー",
   "special1": "ホップソナー",
   "special2": "デコイチラシ",
   "special3": "スミナガシート"
 },
 {
   "name": "クアッドホッパーブラック",
   "name2": "クアッドホッパーホワイト",
   "name3": "-",
   "type": "マニューバー",
   "sub1": "ロボットボム",
   "sub2": "スプリンクラー",
   "sub3": "-",
   "special1": "サメライド",
   "special2": "ショクワンダー",
   "special3": "-"
 },
 {
   "name": "ガエンFF",
   "name2": "ガエンFFカスタム",
   "name3": "-",
   "type": "マニューバー",
   "sub1": "トラップ",
   "sub2": "クイックボム",
   "sub3": "-",
   "special1": "メガホンレーザー5.1ch",
   "special2": "トリプルトルネード",
   "special3": "-"
 },
 {
   "name": "パラシェルター",
   "name2": "パラシェルターソレーラ",
   "name3": "-",
   "type": "シェルター",
   "sub1": "スプリンクラー",
   "sub2": "ロボットボム",
   "sub3": "-",
   "special1": "トリプルトルネード",
   "special2": "ジェットパック",
   "special3": "-"
 },
 {
   "name": "キャンピングシェルター",
   "name2": "キャンピングシェルターソレーラ",
   "name3": "キャンピングシェルターCREM",
   "type": "シェルター",
   "sub1": "ジャンプビーコン",
   "sub2": "トラップ",
   "sub3": "ポイズンミスト",
   "special1": "キューインキ",
   "special2": "ウルトラショット",
   "special3": "デコイチラシ"
 },
 {
   "name": "スパイガジェット",
   "name2": "スパイガジェットソレーラ",
   "name3": "スパイガジェット繚",
   "type": "シェルター",
   "sub1": "トラップ",
   "sub2": "トーピード",
   "sub3": "カーリングボム",
   "special1": "サメライド",
   "special2": "スミナガシート",
   "special3": "メガホンレーザー5.1ch"
 },
 {
   "name": "24式張替傘・甲",
   "name2": "24式張替傘・乙",
   "name3": "-",
   "type": "シェルター",
   "sub1": "ラインマーカー",
   "sub2": "ポイズンミスト",
   "sub3": "-",
   "special1": "グレートバリア",
   "special2": "ウルトラチャクチ",
   "special3": "-"
 },
 {
   "name": "ノヴァブラスター",
   "name2": "ノヴァブラスターネオ",
   "name3": "-",
   "type": "ブラスター",
   "sub1": "スプラッシュボム",
   "sub2": "タンサンボム",
   "sub3": "-",
   "special1": "ショクワンダー",
   "special2": "ウルトラハンコ",
   "special3": "-"
 },
 {
   "name": "ホットブラスター",
   "name2": "ホットブラスターカスタム",
   "name3": "ホットブラスター艶",
   "type": "ブラスター",
   "sub1": "ロボットボム",
   "sub2": "ポイントセンサー",
   "sub3": "ジャンプビーコン",
   "special1": "グレートバリア",
   "special2": "ウルトラチャクチ",
   "special3": "カニタンク"
 },
 {
   "name": "ロングブラスター",
   "name2": "ロングブラスターカスタム",
   "name3": "-",
   "type": "ブラスター",
   "sub1": "キューバンボム",
   "sub2": "スプラッシュボム",
   "sub3": "-",
   "special1": "ホップソナー",
   "special2": "テイオウイカ",
   "special3": "-"
 },
 {
   "name": "クラッシュブラスター",
   "name2": "クラッシュブラスターネオ",
   "name3": "-",
   "type": "ブラスター",
   "sub1": "スプラッシュボム",
   "sub2": "カーリングボム",
   "sub3": "-",
   "special1": "ウルトラショット",
   "special2": "デコイチラシ",
   "special3": "-"
 },
 {
   "name": "ラピッドブラスター",
   "name2": "ラピッドブラスターデコ",
   "name3": "-",
   "type": "ブラスター",
   "sub1": "トラップ",
   "sub2": "トーピード",
   "sub3": "-",
   "special1": "トリプルトルネード",
   "special2": "ジェットパック",
   "special3": "-"
 },
 {
   "name": "Rブラスターエリート",
   "name2": "Rブラスターエリートデコ",
   "name3": "RブラスターエリートWNTR",
   "type": "ブラスター",
   "sub1": "ポイズンミスト",
   "sub2": "ラインマーカー",
   "sub3": "キューバンボム",
   "special1": "キューインキ",
   "special2": "メガホンレーザー5.1ch",
   "special3": "エナジースタンド"
 },
 {
   "name": "S-BLAST92(通常)",
   "name2": "S-BLAST91(亜種)",
   "name3": "-",
   "type": "ブラスター",
   "sub1": "スプリンクラー",
   "sub2": "クイックボム",
   "sub3": "-",
   "special1": "サメライド",
   "special2": "ナイスダマ",
   "special3": "-"
 },
 {
   "name": "パブロ",
   "name2": "パブロ・ヒュー",
   "name3": "-",
   "type": "フデ",
   "sub1": "スプラッシュボム",
   "sub2": "トラップ",
   "sub3": "-",
   "special1": "メガホンレーザー5.1ch",
   "special2": "ウルトラハンコ",
   "special3": "-"
 },
 {
   "name": "ホクサイ",
   "name2": "ホクサイ・ヒュー",
   "name3": "ホクサイ彗",
   "type": "フデ",
   "sub1": "キューバンボム",
   "sub2": "ジャンプビーコン",
   "sub3": "ロボットボム",
   "special1": "ショクワンダー",
   "special2": "アメフラシ",
   "special3": "テイオウイカ"
 },
 {
   "name": "フィンセント",
   "name2": "フィンセント・ヒュー",
   "name3": "フィンセントBRNZ",
   "type": "フデ",
   "sub1": "カーリングボム",
   "sub2": "ポイントセンサー",
   "sub3": "スプラッシュシールド",
   "special1": "ホップソナー",
   "special2": "マルチミサイル",
   "special3": "ウルトラショット"
 },
 {
   "name": "トライストリンガー",
   "name2": "トライストリンガーコラボ",
   "name3": "トライストリンガー燈",
   "type": "ストリンガー",
   "sub1": "ポイズンミスト",
   "sub2": "スプリンクラー",
   "sub3": "ラインマーカー",
   "special1": "メガホンレーザー5.1ch",
   "special2": "デコイチラシ",
   "special3": "ジェットパック"
 },
 {
   "name": "LACT-450",
   "name2": "LACT-450デコ",
   "name3": "-",
   "type": "ストリンガー",
   "sub1": "カーリングボム",
   "sub2": "スプラッシュシールド",
   "sub3": "トーピード",
   "special1": "マルチミサイル",
   "special2": "サメライド",
   "special3": "ナイスダマ"
 },
 {
   "name": "フルイドV",
   "name2": "フルイドVカスタム",
   "name3": "-",
   "type": "ストリンガー",
   "sub1": "ロボットボム",
   "sub2": "ポイントセンサー",
   "sub3": "-",
   "special1": "ウルトラハンコ",
   "special2": "ホップソナー",
   "special3": "-"
 },
 {
   "name": "ジムワイパー",
   "name2": "ジムワイパー・ヒュー",
   "name3": "ジムワイパー封",
   "type": "ワイパー",
   "sub1": "クイックボム",
   "sub2": "ポイズンミスト",
   "sub3": "ロボットボム",
   "special1": "ショクワンダー",
   "special2": "カニタンク",
   "special3": "ナイスダマ"
 },
 {
   "name": "ドライブワイパー",
   "name2": "ドライブワイパーデコ",
   "name3": "ドライブワイパーRUST",
   "type": "ワイパー",
   "sub1": "トーピード",
   "sub2": "ジャンプビーコン",
   "sub3": "カーリングボム",
   "special1": "ウルトラハンコ",
   "special2": "マルチミサイル",
   "special3": "ウルトラショット"
 },
 {
   "name": "デンタルワイパーミント",
   "name2": "デンタルワイパーミントスミ",
   "name3": "-",
   "type": "ワイパー",
   "sub1": "キューバンボム",
   "sub2": "スプラッシュシールド",
   "sub3": "-",
   "special1": "グレートバリア",
   "special2": "ジェットパック",
   "special3": "-"
 }
];
const subli = [
{
   "sub": "タンサンボム",
},
{
   "sub": "トーピード",
},
{
   "sub": "スプラッシュシールド",
},
{
   "sub": "カーリングボム",
},
{
   "sub": "ロボットボム",
},
{
   "sub": "ポイズンミスト",
},
{
   "sub": "トラップ",
},
{
   "sub": "スプラッシュボム",
},
{
   "sub": "クイックボム",
},
{
   "sub": "スプリンクラー",
},
{
   "sub": "キューバンボム",
},
{
   "sub": "ラインマーカー",
},
{
   "sub": "ポイントセンサー",
},
{
   "sub": "ジャンプビーコン",
}
];
const speli = [
{
   "special": "カニタンク",
},
{
   "special": "メガホンレーザー5.1ch",
},
{
   "special": "アメフラシ",
},
{
   "special": "トリプルトルネード",
},
{
   "special": "ショクワンダー",
},
{
   "special": "テイオウイカ",
},
{
   "special": "ホップソナー",
},
{
   "special": "マルチミサイル",
},
{
   "special": "キューインキ",
},
{
   "special": "ウルトラチャクチ",
},
{
   "special": "ナイスダマ",
},
{
   "special": "グレートバリア",
},
{
   "special": "ウルトラショット",
},
{
   "special": "スミナガシート",
},
{
   "special": "ジェットパック",
},
{
   "special": "デコイチラシ",
},
{
   "special": "サメライド",
},
{
   "special": "エナジースタンド",
},
{
   "special": "ウルトラハンコ",
}
];
const wepli = [
{
   "type": "スロッシャー",
},
{
   "type": "ワイパー",
},
{
   "type": "ストリンガー",
},
{
   "type": "チャージャー",
},
{
   "type": "スピナー",
},
{
   "type": "フデ",
},
{
   "type": "ローラー",
},
{
   "type": "シューター",
},
{
   "type": "ブラスター",
},
{
   "type": "シェルター",
},
{
   "type": "マニューバー",
}
];
const stali = [
{
stage: "マンタマリア号",
},
{
stage: "ナメロウ金属",
},
{
stage: "ヒラメが丘団地",
},
{
stage: "カジキ空港",
},
{
stage: "ヤガラ市場",
},
{
stage: "スメーシーワールド",
},
{
stage: "コンブトラック",
},
{
stage: "バイガイ亭",
},
{
stage: "クサヤ温泉",
},
{
stage: "チョウザメ造船",
},
{
stage: "キンメダイ美術館",
},
{
stage: "オヒョウ海運",
},
{
stage: "海女美術大学",
},
{
stage: "ザトウマーケット",
},
{
stage: "マサバ海峡大橋",
},
{
stage: "タカアシ経済特区",
},
{
stage: "マテガイ放水路",
},
{
stage: "タラポートショッピングパーク",
},
{
stage: "マヒマヒリゾート＆スパ",
},
{
stage: "リュウグウターミナル",
},
{
stage: "ネギトロ炭鉱",
},
{
stage: "ナンプラー遺跡",
},
{
stage: "ユノハナ大渓谷",
},
{
stage: "ゴンズイ地区",
}
];
const ruleli = [
{
rule: "ガチエリア",
},
{
rule: "ナワバリ",
},
{
rule: "ガチアサリ",
},
{
rule: "ガチヤグラ",
},
{
rule: "ガチホコ",
}
];
const ruleli3 = [
{
rule3: "ガチホコ",
},
{
rule3: "ガチヤグラ",
},
{
rule3: "ガチエリア",
},

];
const ruleli4 = [
{
rule4: "ナワバリ",
},
{
rule4: "ガチホコ",
},
{
rule4: "ガチエリア",
},
{
rule4: "ガチヤグラ",
}
];
const shoot01 = [
{
   "name": "スプラシューターコラボ",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "ボールドマーカー",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ボトルガイザーフォイル",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "スミナガシート"
},
{
   "name": "ジェットスイーパー",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "キューインキ"
},
{
   "name": ".52ガロン",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ボトルガイザー",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
},
{
   "name": ".96ガロン",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "キューインキ"
},
{
   "name": "シャープマーカー",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "カニタンク"
},
{
   "name": "L3リールガンD",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": ".52ガロンデコ",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "スミナガシート"
},
{
   "name": "プロモデラーMG(銀モデ)",
   "type": "シューター",
   "sub": "タンサンボム",
   "special": "サメライド"
},
{
   "name": "スプラシューター",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ウルトラショット"
},
{
   "name": ".96ガロンデコ",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "テイオウイカ"
},
{
   "name": "ボールドマーカーネオ",
   "type": "シューター",
   "sub": "ジャンプビーコン",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "シャープマーカーネオ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
},
{
   "name": "H3リールガンD",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "グレートバリア"
},
{
   "name": "もみじシューター",
   "type": "シューター",
   "sub": "トーピード",
   "special": "ホップソナー"
},
{
   "name": "スペースシューター",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "わかばシューター",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "グレートバリア"
},
{
   "name": "スペースシューターコラボ",
   "type": "シューター",
   "sub": "トラップ",
   "special": "ジェットパック"
},
{
   "name": "N-ZAP85(黒ザップ)",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
},
{
   "name": "N-ZAP89(赤ザップ)",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "デコイチラシ"
},
{
   "name": "プライムシューター",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "カニタンク"
},
{
   "name": "プライムシューターコラボ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ナイスダマ"
},
{
   "name": "プロモデラーRG(金モデ)",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "ナイスダマ"
},
{
   "name": "L3リールガン",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "カニタンク"
},
{
   "name": "ジェットスイーパーカスタム",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
},
{
   "name": "H3リールガン",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "エナジースタンド"
},
  {
   "name": "スプラシューター煌",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "テイオウイカ"
 },
 {
   "name": ".96ガロン爪",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "エナジースタンド"
 },
 {
   "name": "プロモデラー彩",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "スミナガシート"
 },
 {
   "name": "L3リールガン箔",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "ジェットパック"
 },
 {
   "name": "シャープマーカーGECK",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
 },
 {
   "name": "プライムシューターFRZN",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "マルチミサイル"
 },
 {
   "name": "ジェットスイーパーCOBR",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "H3リールガンSNAK",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
 } 
];
const shoot02 = [
{
   "name": "ワイドローラーコラボ",
   "type": "ローラー",
   "sub": "ラインマーカー",
   "special": "アメフラシ"
},
{
   "name": "カーボンローラー",
   "type": "ローラー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "ダイナモローラー",
   "type": "ローラー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "ダイナモローラーテスラ",
   "type": "ローラー",
   "sub": "スプラッシュボム",
   "special": "デコイチラシ"
},
{
   "name": "カーボンローラーデコ",
   "type": "ローラー",
   "sub": "クイックボム",
   "special": "ウルトラショット"
},
{
   "name": "ヴァリアブルローラーフォイル",
   "type": "ローラー",
   "sub": "キューバンボム",
   "special": "スミナガシート"
},
{
   "name": "ヴァリアブルローラー",
   "type": "ローラー",
   "sub": "トラップ",
   "special": "マルチミサイル"
},
{
   "name": "スプラローラー",
   "type": "ローラー",
   "sub": "カーリングボム",
   "special": "グレートバリア"
},
{
   "name": "ワイドローラー",
   "type": "ローラー",
   "sub": "スプラッシュシールド",
   "special": "キューインキ"
},
{
   "name": "スプラローラーコラボ",
   "type": "ローラー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
  {
   "name": "ダイナモローラー冥",
   "type": "ローラー",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "ワイドローラー惑",
   "type": "ローラー",
   "sub": "トーピード",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "カーボンローラーANGL",
   "type": "ローラー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
 } 
];
const shoot03 = [
{
   "name": "リッター4K or スコープ",
   "type": "チャージャー",
   "sub": "トラップ",
   "special": "ホップソナー"
},
{
   "name": "スプラチャージャーコラボ or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "トリプルトルネード"
},
{
   "name": "R-PEN/5B",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "アメフラシ"
},
{
   "name": "スクイックリンα",
   "type": "チャージャー",
   "sub": "ポイントセンサー",
   "special": "グレートバリア"
},
{
   "name": "ソイチューバー",
   "type": "チャージャー",
   "sub": "トーピード",
   "special": "マルチミサイル"
},
{
   "name": "14式竹筒銃・甲",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "リッター4Kカスタム or スコープ",
   "type": "チャージャー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "スプラチャージャー or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュボム",
   "special": "キューインキ"
},
{
   "name": "14式竹筒銃・乙",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
},
{
   "name": "ソイチューバーカスタム",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "スクイックリンβ",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "R-PEN/5H",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
   {
   "name": "スプラチャージャーFRSTorスコープ",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "カニタンク"
 }
];
const shoot04 = [
{
   "name": "モップリン",
   "type": "スロッシャー",
   "sub": "キューバンボム",
   "special": "サメライド"
},
{
   "name": "オーバーフロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "テイオウイカ"
},
{
   "name": "エクスプロッシャー",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "バケットスロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "ショクワンダー"
},
{
   "name": "スクリュースロッシャーネオ",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "ヒッセン・ヒュー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "エナジースタンド"
},
{
   "name": "バケットスロッシャー",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "モップリンD",
   "type": "スロッシャー",
   "sub": "ジャンプビーコン",
   "special": "ホップソナー"
},
{
   "name": "ヒッセン",
   "type": "スロッシャー",
   "sub": "ポイズンミスト",
   "special": "ジェットパック"
},
{
   "name": "エクスプロッシャーカスタム",
   "type": "スロッシャー",
   "sub": "スプラッシュシールド",
   "special": "ウルトラチャクチ"
},
{
   "name": "スクリュースロッシャー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "ナイスダマ"
},
{
   "name": "オーバーフロッシャー",
   "type": "スロッシャー",
   "sub": "スプリンクラー",
   "special": "アメフラシ"
},
   {
   "name": "モップリン角",
   "type": "スロッシャー",
   "sub": "カーリングボム",
   "special": "カニタンク"
 },
 {
   "name": "ヒッセンASH",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "スミナガシート"
 }
];
const shoot05 = [
{
   "name": "イグザミナー",
   "type": "スピナー",
   "sub": "カーリングボム",
   "special": "エナジースタンド"
},
{
   "name": "バレルスピナー",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "ホップソナー"
},
{
   "name": "ノーチラス79(金ノチ)",
   "type": "スピナー",
   "sub": "キューバンボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "スプラスピナーコラボ",
   "type": "スピナー",
   "sub": "ポイズンミスト",
   "special": "グレートバリア"
},
{
   "name": "ハイドラント",
   "type": "スピナー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
},
{
   "name": "バレルスピナーデコ",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "テイオウイカ"
},
{
   "name": "クーゲルシュライバー",
   "type": "スピナー",
   "sub": "タンサンボム",
   "special": "ジェットパック"
},
{
   "name": "ハイドラントカスタム",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "スミナガシート"
},
{
   "name": "イグザミナー・ヒュー",
   "type": "スピナー",
   "sub": "スプラッシュボム",
   "special": "カニタンク"
},
{
   "name": "ノーチラス47",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "クーゲルシュライバー・ヒュー",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "キューインキ"
},
{
   "name": "スプラスピナー",
   "type": "スピナー",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
 {
   "name": "ハイドラント圧",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "グレートバリア"
 },
 {
   "name": "スプラスピナーPYTN",
   "type": "スピナー",
   "sub": "ジャンプビーコン",
   "special": "ウルトラショット"
 }
];
const shoot06 = [
{
   "name": "ガエンFFカスタム",
   "type": "マニューバー",
   "sub": "クイックボム",
   "special": "トリプルトルネード"
},
{
   "name": "ケルビン525デコ",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "クアッドホッパーブラック",
   "type": "マニューバー",
   "sub": "ロボットボム",
   "special": "サメライド"
},
{
   "name": "クアッドホッパーホワイト",
   "type": "マニューバー",
   "sub": "スプリンクラー",
   "special": "ショクワンダー"
},
{
   "name": "スプラマニューバー",
   "type": "マニューバー",
   "sub": "キューバンボム",
   "special": "カニタンク"
},
{
   "name": "スプラマニューバーコラボ",
   "type": "マニューバー",
   "sub": "カーリングボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "デュアルスイーパーカスタム",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "デコイチラシ"
},
{
   "name": "スパッタリー・ヒュー(青スパ)",
   "type": "マニューバー",
   "sub": "トーピード",
   "special": "サメライド"
},
{
   "name": "ガエンFF",
   "type": "マニューバー",
   "sub": "トラップ",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ケルビン525",
   "type": "マニューバー",
   "sub": "スプラッシュシールド",
   "special": "ナイスダマ"
},
{
   "name": "デュアルスイーパー",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "ホップソナー"
},
{
   "name": "スパッタリー(赤スパ)",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "エナジースタンド"
},
 {
   "name": "スプラマニューバー耀",
   "type": "マニューバー",
   "sub": "タンサンボム",
   "special": "グレートバリア"
 },
 {
   "name": "デュアルスイーパー蹄",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "スミナガシート"
 },
 {
   "name": "スパッタリーOWL",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
 }
];
const shoot07 = [
{
   "name": "パラシェルター",
   "type": "シェルター",
   "sub": "スプリンクラー",
   "special": "トリプルトルネード"
},
{
   "name": "パラシェルターソレーラ",
   "type": "シェルター",
   "sub": "ロボットボム",
   "special": "ジェットパック"
},
{
   "name": "スパイガジェット",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "サメライド"
},
{
   "name": "24式張替傘・甲",
   "type": "シェルター",
   "sub": "ラインマーカー",
   "special": "グレートバリア"
},
{
   "name": "スパイガジェットソレーラ",
   "type": "シェルター",
   "sub": "トーピード",
   "special": "スミナガシート"
},
{
   "name": "キャンピングシェルターソレーラ",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "ウルトラショット"
},
{
   "name": "24式張替傘・乙",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "ウルトラチャクチ"
},
{
   "name": "キャンピングシェルター",
   "type": "シェルター",
   "sub": "ジャンプビーコン",
   "special": "キューインキ"
},
 {
   "name": "スパイガジェット繚",
   "type": "シェルター",
   "sub": "カーリングボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "キャンピングシェルターCREM",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "デコイチラシ"
 }
];
const shoot08 = [
{
   "name": "S-BLAST91(亜種)",
   "type": "ブラスター",
   "sub": "クイックボム",
   "special": "ナイスダマ"
},
{
   "name": "ロングブラスターカスタム",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "テイオウイカ"
},
{
   "name": "Rブラスターエリートデコ",
   "type": "ブラスター",
   "sub": "ラインマーカー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ノヴァブラスターネオ",
   "type": "ブラスター",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ラピッドブラスターデコ",
   "type": "ブラスター",
   "sub": "トーピード",
   "special": "ジェットパック"
},
{
   "name": "クラッシュブラスターネオ",
   "type": "ブラスター",
   "sub": "カーリングボム",
   "special": "デコイチラシ"
},
{
   "name": "ノヴァブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ショクワンダー"
},
{
   "name": "ホットブラスターカスタム",
   "type": "ブラスター",
   "sub": "ポイントセンサー",
   "special": "ウルトラチャクチ"
},
{
   "name": "S-BLAST92(通常)",
   "type": "ブラスター",
   "sub": "スプリンクラー",
   "special": "サメライド"
},
{
   "name": "ホットブラスター",
   "type": "ブラスター",
   "sub": "ロボットボム",
   "special": "グレートバリア"
},
{
   "name": "Rブラスターエリート",
   "type": "ブラスター",
   "sub": "ポイズンミスト",
   "special": "キューインキ"
},
{
   "name": "クラッシュブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ウルトラショット"
},
{
   "name": "ロングブラスター",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "ホップソナー"
},
{
   "name": "ラピッドブラスター",
   "type": "ブラスター",
   "sub": "トラップ",
   "special": "トリプルトルネード"
},
 {
   "name": "ホットブラスター艶",
   "type": "ブラスター",
   "sub": "ジャンプビーコン",
   "special": "カニタンク"
 },
 {
   "name": "RブラスターエリートWNTR",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
 }
];
const shoot09 = [
{
   "name": "フィンセント・ヒュー",
   "type": "フデ",
   "sub": "ポイントセンサー",
   "special": "マルチミサイル"
},
{
   "name": "パブロ・ヒュー",
   "type": "フデ",
   "sub": "トラップ",
   "special": "ウルトラハンコ"
},
{
   "name": "ホクサイ",
   "type": "フデ",
   "sub": "キューバンボム",
   "special": "ショクワンダー"
},
{
   "name": "フィンセント",
   "type": "フデ",
   "sub": "カーリングボム",
   "special": "ホップソナー"
},
{
   "name": "ホクサイ・ヒュー",
   "type": "フデ",
   "sub": "ジャンプビーコン",
   "special": "アメフラシ"
},
{
   "name": "パブロ",
   "type": "フデ",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
},
 {
   "name": "ホクサイ彗",
   "type": "フデ",
   "sub": "ロボットボム",
   "special": "テイオウイカ"
 },
 {
   "name": "フィンセントBRNZ",
   "type": "フデ",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
 }
];
const shoot10 = [
{
   "name": "フルイドV",
   "type": "ストリンガー",
   "sub": "ロボットボム",
   "special": "ウルトラハンコ"
},
{
   "name": "フルイドVカスタム",
   "type": "ストリンガー",
   "sub": "ポイントセンサー",
   "special": "ホップソナー"
},
{
   "name": "トライストリンガー",
   "type": "ストリンガー",
   "sub": "ポイズンミスト",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "トライストリンガーコラボ",
   "type": "ストリンガー",
   "sub": "スプリンクラー",
   "special": "デコイチラシ"
},
{
   "name": "LACT-450デコ",
   "type": "ストリンガー",
   "sub": "スプラッシュシールド",
   "special": "サメライド"
},
{
   "name": "LACT-450",
   "type": "ストリンガー",
   "sub": "カーリングボム",
   "special": "マルチミサイル"
},
 {
   "name": "トライストリンガー燈",
   "type": "ストリンガー",
   "sub": "ラインマーカー",
   "special": "ジェットパック"
 },
 {
   "name": "LACT-450MILK",
   "type": "ストリンガー",
   "sub": "トーピード",
   "special": "ナイスダマ"
 }
];
const shoot11 = [
{
   "name": "ジムワイパー",
   "type": "ワイパー",
   "sub": "クイックボム",
   "special": "ショクワンダー"
},
{
   "name": "ドライブワイパーデコ",
   "type": "ワイパー",
   "sub": "ジャンプビーコン",
   "special": "マルチミサイル"
},
{
   "name": "デンタルワイパースミ",
   "type": "ワイパー",
   "sub": "スプラッシュシールド",
   "special": "ジェットパック"
},
{
   "name": "ドライブワイパー",
   "type": "ワイパー",
   "sub": "トーピード",
   "special": "ウルトラハンコ"
},
{
   "name": "デンタルワイパーミント",
   "type": "ワイパー",
   "sub": "キューバンボム",
   "special": "グレートバリア"
},
{
   "name": "ジムワイパー・ヒュー",
   "type": "ワイパー",
   "sub": "ポイズンミスト",
   "special": "カニタンク"
},
 {
   "name": "ジムワイパー封",
   "type": "ワイパー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
 },
 {
   "name": "ドライブワイパーRUST",
   "type": "ワイパー",
   "sub": "カーリングボム",
   "special": "ウルトラショット"
 }
];
const shoot20 = [
{
   "name": "スパイガジェット",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "サメライド"
},
{
   "name": "N-ZAP89(赤ザップ)",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "デコイチラシ"
},
{
   "name": "ヒッセン・ヒュー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "エナジースタンド"
},
{
   "name": "クラッシュブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ウルトラショット"
},
{
   "name": "ホクサイ",
   "type": "フデ",
   "sub": "キューバンボム",
   "special": "ショクワンダー"
},
{
   "name": "ボールドマーカーネオ",
   "type": "シューター",
   "sub": "ジャンプビーコン",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ヒッセン",
   "type": "スロッシャー",
   "sub": "ポイズンミスト",
   "special": "ジェットパック"
},
{
   "name": "もみじシューター",
   "type": "シューター",
   "sub": "トーピード",
   "special": "ホップソナー"
},
{
   "name": "ホクサイ・ヒュー",
   "type": "フデ",
   "sub": "ジャンプビーコン",
   "special": "アメフラシ"
},
{
   "name": "ホットブラスター",
   "type": "ブラスター",
   "sub": "ロボットボム",
   "special": "グレートバリア"
},
{
   "name": "ノヴァブラスターネオ",
   "type": "ブラスター",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "スプラマニューバー",
   "type": "マニューバー",
   "sub": "キューバンボム",
   "special": "カニタンク"
},
{
   "name": "パラシェルターソレーラ",
   "type": "シェルター",
   "sub": "ロボットボム",
   "special": "ジェットパック"
},
{
   "name": "ドライブワイパー",
   "type": "ワイパー",
   "sub": "トーピード",
   "special": "ウルトラハンコ"
},
{
   "name": "L3リールガン",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "カニタンク"
},
{
   "name": "クラッシュブラスターネオ",
   "type": "ブラスター",
   "sub": "カーリングボム",
   "special": "デコイチラシ"
},
{
   "name": "ボールドマーカー",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "ウルトラハンコ"
},
{
   "name": "スパイガジェットソレーラ",
   "type": "シェルター",
   "sub": "トーピード",
   "special": "スミナガシート"
},
{
   "name": "スプラローラー",
   "type": "ローラー",
   "sub": "カーリングボム",
   "special": "グレートバリア"
},
{
   "name": "スプラマニューバーコラボ",
   "type": "マニューバー",
   "sub": "カーリングボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "ドライブワイパーデコ",
   "type": "ワイパー",
   "sub": "ジャンプビーコン",
   "special": "マルチミサイル"
},
{
   "name": "ノヴァブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ショクワンダー"
},
{
   "name": "スプラシューター",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ウルトラショット"
},
{
   "name": ".52ガロンデコ",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "スミナガシート"
},
{
   "name": ".52ガロン",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "カーボンローラー",
   "type": "ローラー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "パブロ",
   "type": "フデ",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "L3リールガンD",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ホットブラスターカスタム",
   "type": "ブラスター",
   "sub": "ポイントセンサー",
   "special": "ウルトラチャクチ"
},
{
   "name": "プロモデラーMG(銀モデ)",
   "type": "シューター",
   "sub": "タンサンボム",
   "special": "サメライド"
},
{
   "name": "ワイドローラーコラボ",
   "type": "ローラー",
   "sub": "ラインマーカー",
   "special": "アメフラシ"
},
{
   "name": "カーボンローラーデコ",
   "type": "ローラー",
   "sub": "クイックボム",
   "special": "ウルトラショット"
},
{
   "name": "フィンセント",
   "type": "フデ",
   "sub": "カーリングボム",
   "special": "ホップソナー"
},
{
   "name": "パブロ・ヒュー",
   "type": "フデ",
   "sub": "トラップ",
   "special": "ウルトラハンコ"
},
{
   "name": "シャープマーカーネオ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
},
{
   "name": "シャープマーカー",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "カニタンク"
},
{
   "name": "N-ZAP85(黒ザップ)",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
},
{
   "name": "スプラローラーコラボ",
   "type": "ローラー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "スプラシューターコラボ",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "フィンセント・ヒュー",
   "type": "フデ",
   "sub": "ポイントセンサー",
   "special": "マルチミサイル"
},
{
   "name": "プロモデラーRG(金モデ)",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "ナイスダマ"
},
{
   "name": "わかばシューター",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "グレートバリア"
},
{
   "name": "ワイドローラー",
   "type": "ローラー",
   "sub": "スプラッシュシールド",
   "special": "キューインキ"
},
{
   "name": "スパッタリー(赤スパ)",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "エナジースタンド"
},
{
   "name": "スパッタリー・ヒュー(青スパ)",
   "type": "マニューバー",
   "sub": "トーピード",
   "special": "サメライド"
},
{
   "name": "パラシェルター",
   "type": "シェルター",
   "sub": "スプリンクラー",
   "special": "トリプルトルネード"
},
 {
   "name": "スプラシューター煌",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "テイオウイカ"
 },
 {
   "name": "プロモデラー彩",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "スミナガシート"
 },
 {
   "name": "L3リールガン箔",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "ジェットパック"
 },
 {
   "name": "ワイドローラー惑",
   "type": "ローラー",
   "sub": "トーピード",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "スプラマニューバー耀",
   "type": "マニューバー",
   "sub": "タンサンボム",
   "special": "グレートバリア"
 },
 {
   "name": "スパイガジェット繚",
   "type": "シェルター",
   "sub": "カーリングボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "ホットブラスター艶",
   "type": "ブラスター",
   "sub": "ジャンプビーコン",
   "special": "カニタンク"
 },
 {
   "name": "ホクサイ彗",
   "type": "フデ",
   "sub": "ロボットボム",
   "special": "テイオウイカ"
 },
 {
   "name": "シャープマーカーGECK",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
 },
 {
   "name": "ヒッセンASH",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "スミナガシート"
 },
 {
   "name": "カーボンローラーANGL",
   "type": "ローラー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
 },
 {
   "name": "スパッタリーOWL",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "フィンセントBRNZ",
   "type": "フデ",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
 },
 {
   "name": "ドライブワイパーRUST",
   "type": "ワイパー",
   "sub": "カーリングボム",
   "special": "ウルトラショット"
 }
];
const shoot21 = [
{
   "name": "バケットスロッシャー",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "デンタルワイパーミント",
   "type": "ワイパー",
   "sub": "キューバンボム",
   "special": "グレートバリア"
},
{
   "name": "オーバーフロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "テイオウイカ"
},
{
   "name": "スペースシューター",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ノーチラス79(金ノチ)",
   "type": "スピナー",
   "sub": "キューバンボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "ケルビン525",
   "type": "マニューバー",
   "sub": "スプラッシュシールド",
   "special": "ナイスダマ"
},
{
   "name": "スクリュースロッシャー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "ナイスダマ"
},
{
   "name": "ノーチラス47",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "デンタルワイパースミ",
   "type": "ワイパー",
   "sub": "スプラッシュシールド",
   "special": "ジェットパック"
},
{
   "name": "スプラスピナー",
   "type": "スピナー",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "クアッドホッパーブラック",
   "type": "マニューバー",
   "sub": "ロボットボム",
   "special": "サメライド"
},
{
   "name": "S-BLAST92(通常)",
   "type": "ブラスター",
   "sub": "スプリンクラー",
   "special": "サメライド"
},
{
   "name": ".96ガロンデコ",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "テイオウイカ"
},
{
   "name": "ダイナモローラーテスラ",
   "type": "ローラー",
   "sub": "スプラッシュボム",
   "special": "デコイチラシ"
},
{
   "name": "ロングブラスターカスタム",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "テイオウイカ"
},
{
   "name": "ラピッドブラスター",
   "type": "ブラスター",
   "sub": "トラップ",
   "special": "トリプルトルネード"
},
{
   "name": "H3リールガン",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "エナジースタンド"
},
{
   "name": "プライムシューターコラボ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ナイスダマ"
},
{
   "name": "ジムワイパー・ヒュー",
   "type": "ワイパー",
   "sub": "ポイズンミスト",
   "special": "カニタンク"
},
{
   "name": "ダイナモローラー",
   "type": "ローラー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "LACT-450",
   "type": "ストリンガー",
   "sub": "カーリングボム",
   "special": "マルチミサイル"
},
{
   "name": "24式張替傘・乙",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "ウルトラチャクチ"
},
{
   "name": "クアッドホッパーホワイト",
   "type": "マニューバー",
   "sub": "スプリンクラー",
   "special": "ショクワンダー"
},
{
   "name": "ロングブラスター",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "ホップソナー"
},
{
   "name": "キャンピングシェルターソレーラ",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "ウルトラショット"
},
{
   "name": "イグザミナー・ヒュー",
   "type": "スピナー",
   "sub": "スプラッシュボム",
   "special": "カニタンク"
},
{
   "name": "スペースシューターコラボ",
   "type": "シューター",
   "sub": "トラップ",
   "special": "ジェットパック"
},
{
   "name": ".96ガロン",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "キューインキ"
},
{
   "name": "LACT-450デコ",
   "type": "ストリンガー",
   "sub": "スプラッシュシールド",
   "special": "サメライド"
},
{
   "name": "スクリュースロッシャーネオ",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "デュアルスイーパー",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "ホップソナー"
},
{
   "name": "ヴァリアブルローラー",
   "type": "ローラー",
   "sub": "トラップ",
   "special": "マルチミサイル"
},
{
   "name": "スプラスピナーコラボ",
   "type": "スピナー",
   "sub": "ポイズンミスト",
   "special": "グレートバリア"
},
{
   "name": "デュアルスイーパーカスタム",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "デコイチラシ"
},
{
   "name": "24式張替傘・甲",
   "type": "シェルター",
   "sub": "ラインマーカー",
   "special": "グレートバリア"
},
{
   "name": "バケットスロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "ショクワンダー"
},
{
   "name": "H3リールガンD",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "グレートバリア"
},
{
   "name": "プライムシューター",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "カニタンク"
},
{
   "name": "オーバーフロッシャー",
   "type": "スロッシャー",
   "sub": "スプリンクラー",
   "special": "アメフラシ"
},
{
   "name": "モップリンD",
   "type": "スロッシャー",
   "sub": "ジャンプビーコン",
   "special": "ホップソナー"
},
{
   "name": "ケルビン525デコ",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "ヴァリアブルローラーフォイル",
   "type": "ローラー",
   "sub": "キューバンボム",
   "special": "スミナガシート"
},
{
   "name": "ジムワイパー",
   "type": "ワイパー",
   "sub": "クイックボム",
   "special": "ショクワンダー"
},
{
   "name": "S-BLAST91(亜種)",
   "type": "ブラスター",
   "sub": "クイックボム",
   "special": "ナイスダマ"
},
{
   "name": "ラピッドブラスターデコ",
   "type": "ブラスター",
   "sub": "トーピード",
   "special": "ジェットパック"
},
{
   "name": "イグザミナー",
   "type": "スピナー",
   "sub": "カーリングボム",
   "special": "エナジースタンド"
},
{
   "name": "キャンピングシェルター",
   "type": "シェルター",
   "sub": "ジャンプビーコン",
   "special": "キューインキ"
},
{
   "name": "モップリン",
   "type": "スロッシャー",
   "sub": "キューバンボム",
   "special": "サメライド"
},
 {
   "name": ".96ガロン爪",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "エナジースタンド"
 },
 {
   "name": "デュアルスイーパー蹄",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "スミナガシート"
 },
 {
   "name": "ジムワイパー封",
   "type": "ワイパー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
 },
 {
   "name": "プライムシューターFRZN",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "マルチミサイル"
 },
 {
   "name": "H3リールガンSNAK",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
 },
 {
   "name": "スプラスピナーPYTN",
   "type": "スピナー",
   "sub": "ジャンプビーコン",
   "special": "ウルトラショット"
 },
 {
   "name": "キャンピングシェルターCREM",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "デコイチラシ"
 },
 {
   "name": "LACT-450MILK",
   "type": "ストリンガー",
   "sub": "トーピード",
   "special": "ナイスダマ"
 }
];
const shoot22 = [
{
   "name": "エクスプロッシャーカスタム",
   "type": "スロッシャー",
   "sub": "スプラッシュシールド",
   "special": "ウルトラチャクチ"
},
{
   "name": "クーゲルシュライバー・ヒュー",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "キューインキ"
},
{
   "name": "バレルスピナー",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "ホップソナー"
},
{
   "name": "ボトルガイザーフォイル",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "スミナガシート"
},
{
   "name": "エクスプロッシャー",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "Rブラスターエリート",
   "type": "ブラスター",
   "sub": "ポイズンミスト",
   "special": "キューインキ"
},
{
   "name": "ガエンFFカスタム",
   "type": "マニューバー",
   "sub": "クイックボム",
   "special": "トリプルトルネード"
},
{
   "name": "ハイドラントカスタム",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "スミナガシート"
},
{
   "name": "Rブラスターエリートデコ",
   "type": "ブラスター",
   "sub": "ラインマーカー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "フルイドV",
   "type": "ストリンガー",
   "sub": "ロボットボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ハイドラント",
   "type": "スピナー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
},
{
   "name": "トライストリンガー",
   "type": "ストリンガー",
   "sub": "ポイズンミスト",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "トライストリンガーコラボ",
   "type": "ストリンガー",
   "sub": "スプリンクラー",
   "special": "デコイチラシ"
},
{
   "name": "ボトルガイザー",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
},
{
   "name": "ジェットスイーパーカスタム",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
},
{
   "name": "クーゲルシュライバー",
   "type": "スピナー",
   "sub": "タンサンボム",
   "special": "ジェットパック"
},
{
   "name": "フルイドVカスタム",
   "type": "ストリンガー",
   "sub": "ポイントセンサー",
   "special": "ホップソナー"
},
{
   "name": "ガエンFF",
   "type": "マニューバー",
   "sub": "トラップ",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ジェットスイーパー",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "キューインキ"
},
{
   "name": "バレルスピナーデコ",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "テイオウイカ"
},
 {
   "name": "モップリン角",
   "type": "スロッシャー",
   "sub": "カーリングボム",
   "special": "カニタンク"
 },
 {
   "name": "ダイナモローラー冥",
   "type": "ローラー",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "ハイドラント圧",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "グレートバリア"
 },
 {
   "name": "トライストリンガー燈",
   "type": "ストリンガー",
   "sub": "ラインマーカー",
   "special": "ジェットパック"
 },
 {
   "name": "ジェットスイーパーCOBR",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "RブラスターエリートWNTR",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
 }
];
const shoot23 = [
{
   "name": "ソイチューバー",
   "type": "チャージャー",
   "sub": "トーピード",
   "special": "マルチミサイル"
},
{
   "name": "14式竹筒銃・乙",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
},
{
   "name": "ソイチューバーカスタム",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "スクイックリンα",
   "type": "チャージャー",
   "sub": "ポイントセンサー",
   "special": "グレートバリア"
},
{
   "name": "14式竹筒銃・甲",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "スクイックリンβ",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
}
];
const shoot24 = [
{
   "name": "R-PEN/5H",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "リッター4Kカスタム or スコープ",
   "type": "チャージャー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "スプラチャージャーコラボ or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "トリプルトルネード"
},
{
   "name": "リッター4K or スコープ",
   "type": "チャージャー",
   "sub": "トラップ",
   "special": "ホップソナー"
},
{
   "name": "スプラチャージャー or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュボム",
   "special": "キューインキ"
},
{
   "name": "R-PEN/5B",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "アメフラシ"
},
 {
   "name": "スプラチャージャーFRST or スコープ",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "カニタンク"
 }
];
const shoot30 = [
	{
   "name": "ロングブラスターカスタム",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "テイオウイカ"
},
{
   "name": "スプラシューターコラボ",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "デュアルスイーパー",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "ホップソナー"
},
{
   "name": "イグザミナー・ヒュー",
   "type": "スピナー",
   "sub": "スプラッシュボム",
   "special": "カニタンク"
},
{
   "name": "パブロ",
   "type": "フデ",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "クラッシュブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ウルトラショット"
},
{
   "name": "スプラチャージャー or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュボム",
   "special": "キューインキ"
},
{
   "name": "ノヴァブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ショクワンダー"
},
{
   "name": "バケットスロッシャー",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "わかばシューター",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "グレートバリア"
},
{
   "name": "ダイナモローラーテスラ",
   "type": "ローラー",
   "sub": "スプラッシュボム",
   "special": "デコイチラシ"
},
 {
   "name": "L3リールガン箔",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "ジェットパック"
 },
 {
   "name": "プライムシューターFRZN",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "マルチミサイル"
 },
 {
   "name": "ヒッセンASH",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "スミナガシート"
 },
 {
   "name": "スパッタリーOWL",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
 }
];
const shoot31 = [
{
   "name": "スプラシューター",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ウルトラショット"
},
{
   "name": "スプラマニューバー",
   "type": "マニューバー",
   "sub": "キューバンボム",
   "special": "カニタンク"
},
{
   "name": "モップリン",
   "type": "スロッシャー",
   "sub": "キューバンボム",
   "special": "サメライド"
},
{
   "name": "ヴァリアブルローラーフォイル",
   "type": "ローラー",
   "sub": "キューバンボム",
   "special": "スミナガシート"
},
{
   "name": "デンタルワイパーミント",
   "type": "ワイパー",
   "sub": "キューバンボム",
   "special": "グレートバリア"
},
{
   "name": "プライムシューターコラボ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ナイスダマ"
},
{
   "name": "シャープマーカーネオ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
},
{
   "name": "N-ZAP85(黒ザップ)",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
},
{
   "name": "ロングブラスター",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "ホップソナー"
},
{
   "name": "ノーチラス79(金ノチ)",
   "type": "スピナー",
   "sub": "キューバンボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "ホクサイ",
   "type": "フデ",
   "sub": "キューバンボム",
   "special": "ショクワンダー"
},
 {
   "name": "H3リールガンSNAK",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
 },
 {
   "name": "RブラスターエリートWNTR",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
 }
];
const shoot32 = [
{
   "name": "ジムワイパー",
   "type": "ワイパー",
   "sub": "クイックボム",
   "special": "ショクワンダー"
},
{
   "name": "カーボンローラーデコ",
   "type": "ローラー",
   "sub": "クイックボム",
   "special": "ウルトラショット"
},
{
   "name": "ガエンFFカスタム",
   "type": "マニューバー",
   "sub": "クイックボム",
   "special": "トリプルトルネード"
},
{
   "name": "スプラスピナー",
   "type": "スピナー",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "シャープマーカー",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "カニタンク"
},
{
   "name": "S-BLAST91(亜種)",
   "type": "ブラスター",
   "sub": "クイックボム",
   "special": "ナイスダマ"
},
{
   "name": "L3リールガンD",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
 {
   "name": "スプラシューター煌",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "テイオウイカ"
 },
 {
   "name": "プロモデラー彩",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "スミナガシート"
 },
 {
   "name": "ジェットスイーパーCOBR",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラチャクチ"
 }
];
const shoot33 = [
{
   "name": "R-PEN/5H",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "クアッドホッパーホワイト",
   "type": "マニューバー",
   "sub": "スプリンクラー",
   "special": "ショクワンダー"
},
{
   "name": "プロモデラーRG(金モデ)",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "ナイスダマ"
},
{
   "name": ".96ガロン",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "キューインキ"
},
{
   "name": "バレルスピナー",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "ホップソナー"
},
{
   "name": "ダイナモローラー",
   "type": "ローラー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "トライストリンガーコラボ",
   "type": "ストリンガー",
   "sub": "スプリンクラー",
   "special": "デコイチラシ"
},
{
   "name": "オーバーフロッシャー",
   "type": "スロッシャー",
   "sub": "スプリンクラー",
   "special": "アメフラシ"
},
{
   "name": "パラシェルター",
   "type": "シェルター",
   "sub": "スプリンクラー",
   "special": "トリプルトルネード"
},
{
   "name": "S-BLAST92(通常)",
   "type": "ブラスター",
   "sub": "スプリンクラー",
   "special": "サメライド"
},
 {
   "name": "ハイドラント圧",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "グレートバリア"
 },
 {
   "name": "スプラチャージャーFRST or スコープ",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "カニタンク"
 }
];
const shoot34 = [
{
   "name": "ワイドローラー",
   "type": "ローラー",
   "sub": "スプラッシュシールド",
   "special": "キューインキ"
},
{
   "name": "LACT-450デコ",
   "type": "ストリンガー",
   "sub": "スプラッシュシールド",
   "special": "サメライド"
},
{
   "name": "デンタルワイパースミ",
   "type": "ワイパー",
   "sub": "スプラッシュシールド",
   "special": "ジェットパック"
},
{
   "name": "スプラチャージャーコラボ or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "トリプルトルネード"
},
{
   "name": ".52ガロン",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ボトルガイザー",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
},
{
   "name": "ケルビン525",
   "type": "マニューバー",
   "sub": "スプラッシュシールド",
   "special": "ナイスダマ"
},
{
   "name": "R-PEN/5B",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "アメフラシ"
},
{
   "name": ".96ガロンデコ",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "テイオウイカ"
},
{
   "name": "エクスプロッシャーカスタム",
   "type": "スロッシャー",
   "sub": "スプラッシュシールド",
   "special": "ウルトラチャクチ"
},
{
   "name": "H3リールガンD",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "グレートバリア"
},
 {
   "name": "フィンセントBRNZ",
   "type": "フデ",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
 }
];
const shoot35 = [
{
   "name": "14式竹筒銃・乙",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
},
{
   "name": "プロモデラーMG(銀モデ)",
   "type": "シューター",
   "sub": "タンサンボム",
   "special": "サメライド"
},
{
   "name": "スクリュースロッシャー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "ナイスダマ"
},
{
   "name": "ソイチューバーカスタム",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "クーゲルシュライバー",
   "type": "スピナー",
   "sub": "タンサンボム",
   "special": "ジェットパック"
},
{
   "name": "ヒッセン・ヒュー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "エナジースタンド"
},
{
   "name": "ノヴァブラスターネオ",
   "type": "ブラスター",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
 {
   "name": "スプラマニューバー耀",
   "type": "マニューバー",
   "sub": "タンサンボム",
   "special": "グレートバリア"
 },
 {
   "name": "カーボンローラーANGL",
   "type": "ローラー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
 }
];
const shoot36 = [
{
   "name": "スプラマニューバーコラボ",
   "type": "マニューバー",
   "sub": "カーリングボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "スプラローラー",
   "type": "ローラー",
   "sub": "カーリングボム",
   "special": "グレートバリア"
},
{
   "name": "クラッシュブラスターネオ",
   "type": "ブラスター",
   "sub": "カーリングボム",
   "special": "デコイチラシ"
},
{
   "name": ".52ガロンデコ",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "スミナガシート"
},
{
   "name": "イグザミナー",
   "type": "スピナー",
   "sub": "カーリングボム",
   "special": "エナジースタンド"
},
{
   "name": "ボールドマーカー",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "ウルトラハンコ"
},
{
   "name": "L3リールガン",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "カニタンク"
},
{
   "name": "フィンセント",
   "type": "フデ",
   "sub": "カーリングボム",
   "special": "ホップソナー"
},
{
   "name": "LACT-450",
   "type": "ストリンガー",
   "sub": "カーリングボム",
   "special": "マルチミサイル"
},
 {
   "name": "モップリン角",
   "type": "スロッシャー",
   "sub": "カーリングボム",
   "special": "カニタンク"
 },
 {
   "name": "スパイガジェット繚",
   "type": "シェルター",
   "sub": "カーリングボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "ドライブワイパーRUST",
   "type": "ワイパー",
   "sub": "カーリングボム",
   "special": "ウルトラショット"
 }
];
const shoot37 = [
{
   "name": "N-ZAP89(赤ザップ)",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "デコイチラシ"
},
{
   "name": "カーボンローラー",
   "type": "ローラー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "ハイドラント",
   "type": "スピナー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
},
{
   "name": "クアッドホッパーブラック",
   "type": "マニューバー",
   "sub": "ロボットボム",
   "special": "サメライド"
},
{
   "name": "パラシェルターソレーラ",
   "type": "シェルター",
   "sub": "ロボットボム",
   "special": "ジェットパック"
},
{
   "name": "ボトルガイザーフォイル",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "スミナガシート"
},
{
   "name": "14式竹筒銃・甲",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ホットブラスター",
   "type": "ブラスター",
   "sub": "ロボットボム",
   "special": "グレートバリア"
},
{
   "name": "スクイックリンβ",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "フルイドV",
   "type": "ストリンガー",
   "sub": "ロボットボム",
   "special": "ウルトラハンコ"
},
 {
   "name": "ホクサイ彗",
   "type": "フデ",
   "sub": "ロボットボム",
   "special": "テイオウイカ"
 },
 {
   "name": "ジムワイパー封",
   "type": "ワイパー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
 }
];
const shoot38 = [
{
   "name": "キャンピングシェルター",
   "type": "シェルター",
   "sub": "ジャンプビーコン",
   "special": "キューインキ"
},
{
   "name": "リッター4Kカスタム or スコープ",
   "type": "チャージャー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "ボールドマーカーネオ",
   "type": "シューター",
   "sub": "ジャンプビーコン",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "デュアルスイーパーカスタム",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "デコイチラシ"
},
{
   "name": "スプラローラーコラボ",
   "type": "ローラー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "ドライブワイパーデコ",
   "type": "ワイパー",
   "sub": "ジャンプビーコン",
   "special": "マルチミサイル"
},
{
   "name": "モップリンD",
   "type": "スロッシャー",
   "sub": "ジャンプビーコン",
   "special": "ホップソナー"
},
{
   "name": "ホクサイ・ヒュー",
   "type": "フデ",
   "sub": "ジャンプビーコン",
   "special": "アメフラシ"
},
{
   "name": "スパッタリー(赤スパ)",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "エナジースタンド"
},
{
   "name": "ホットブラスター艶",
   "type": "ブラスター",
   "sub": "ジャンプビーコン",
   "special": "カニタンク"
 },
 {
   "name": "スプラスピナーPYTN",
   "type": "スピナー",
   "sub": "ジャンプビーコン",
   "special": "ウルトラショット"
 }
];
const shoot39 = [
{
   "name": "ホットブラスターカスタム",
   "type": "ブラスター",
   "sub": "ポイントセンサー",
   "special": "ウルトラチャクチ"
},
{
   "name": "スクイックリンα",
   "type": "チャージャー",
   "sub": "ポイントセンサー",
   "special": "グレートバリア"
},
{
   "name": "H3リールガン",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "エナジースタンド"
},
{
   "name": "フィンセント・ヒュー",
   "type": "フデ",
   "sub": "ポイントセンサー",
   "special": "マルチミサイル"
},
{
   "name": "ノーチラス47",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "エクスプロッシャー",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "スペースシューター",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "フルイドVカスタム",
   "type": "ストリンガー",
   "sub": "ポイントセンサー",
   "special": "ホップソナー"
},
{
   "name": "バレルスピナーデコ",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "テイオウイカ"
},
{
   "name": "ケルビン525デコ",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "スクリュースロッシャーネオ",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
 {
   "name": "ダイナモローラー冥",
   "type": "ローラー",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "デュアルスイーパー蹄",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "スミナガシート"
 }
];
const shoot40 = [
{
   "name": "スパイガジェット",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "サメライド"
},
{
   "name": "ガエンFF",
   "type": "マニューバー",
   "sub": "トラップ",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "リッター4K or スコープ",
   "type": "チャージャー",
   "sub": "トラップ",
   "special": "ホップソナー"
},
{
   "name": "ヴァリアブルローラー",
   "type": "ローラー",
   "sub": "トラップ",
   "special": "マルチミサイル"
},
{
   "name": "クーゲルシュライバー・ヒュー",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "キューインキ"
},
{
   "name": "ハイドラントカスタム",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "スミナガシート"
},
{
   "name": "パブロ・ヒュー",
   "type": "フデ",
   "sub": "トラップ",
   "special": "ウルトラハンコ"
},
{
   "name": "キャンピングシェルターソレーラ",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "ウルトラショット"
},
{
   "name": "ラピッドブラスター",
   "type": "ブラスター",
   "sub": "トラップ",
   "special": "トリプルトルネード"
},
{
   "name": "スペースシューターコラボ",
   "type": "シューター",
   "sub": "トラップ",
   "special": "ジェットパック"
}
];
const shoot41 = [
{
   "name": "24式張替傘・乙",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "ウルトラチャクチ"
},
{
   "name": "ヒッセン",
   "type": "スロッシャー",
   "sub": "ポイズンミスト",
   "special": "ジェットパック"
},
{
   "name": "Rブラスターエリート",
   "type": "ブラスター",
   "sub": "ポイズンミスト",
   "special": "キューインキ"
},
{
   "name": "ジムワイパー・ヒュー",
   "type": "ワイパー",
   "sub": "ポイズンミスト",
   "special": "カニタンク"
},
{
   "name": "スプラスピナーコラボ",
   "type": "スピナー",
   "sub": "ポイズンミスト",
   "special": "グレートバリア"
},
{
   "name": "ジェットスイーパーカスタム",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
},
{
   "name": "トライストリンガー",
   "type": "ストリンガー",
   "sub": "ポイズンミスト",
   "special": "メガホンレーザー5.1ch"
},
 {
   "name": "シャープマーカーGECK",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
 },
 {
   "name": "キャンピングシェルターCREM",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "デコイチラシ"
 }
];
const shoot42 = [
{
   "name": "オーバーフロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "テイオウイカ"
},
{
   "name": "バケットスロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "ショクワンダー"
},
{
   "name": "ジェットスイーパー",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "キューインキ"
},
{
   "name": "Rブラスターエリートデコ",
   "type": "ブラスター",
   "sub": "ラインマーカー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "24式張替傘・甲",
   "type": "シェルター",
   "sub": "ラインマーカー",
   "special": "グレートバリア"
},
{
   "name": "ワイドローラーコラボ",
   "type": "ローラー",
   "sub": "ラインマーカー",
   "special": "アメフラシ"
},
{
   "name": "プライムシューター",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "カニタンク"
},
 {
   "name": ".96ガロン爪",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "エナジースタンド"
 },
 {
   "name": "トライストリンガー燈",
   "type": "ストリンガー",
   "sub": "ラインマーカー",
   "special": "ジェットパック"
 }
];
const shoot43 = [
{
   "name": "もみじシューター",
   "type": "シューター",
   "sub": "トーピード",
   "special": "ホップソナー"
},
{
   "name": "ラピッドブラスターデコ",
   "type": "ブラスター",
   "sub": "トーピード",
   "special": "ジェットパック"
},
{
   "name": "ドライブワイパー",
   "type": "ワイパー",
   "sub": "トーピード",
   "special": "ウルトラハンコ"
},
{
   "name": "スパイガジェットソレーラ",
   "type": "シェルター",
   "sub": "トーピード",
   "special": "スミナガシート"
},
{
   "name": "ソイチューバー",
   "type": "チャージャー",
   "sub": "トーピード",
   "special": "マルチミサイル"
},
{
   "name": "スパッタリー・ヒュー(青スパ)",
   "type": "マニューバー",
   "sub": "トーピード",
   "special": "サメライド"
},
 {
   "name": "ワイドローラー惑",
   "type": "ローラー",
   "sub": "トーピード",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "LACT-450MILK",
   "type": "ストリンガー",
   "sub": "トーピード",
   "special": "ナイスダマ"
 }
];
const shoot50 = [
{
   "name": "カーボンローラーデコ",
   "type": "ローラー",
   "sub": "クイックボム",
   "special": "ウルトラショット"
},
{
   "name": "スプラシューター",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ウルトラショット"
},
{
   "name": "ボトルガイザー",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
},
{
   "name": "キャンピングシェルターソレーラ",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "ウルトラショット"
},
{
   "name": "クラッシュブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ウルトラショット"
},
{
   "name": "ケルビン525デコ",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
{
   "name": "スクリュースロッシャーネオ",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "ウルトラショット"
},
 {
   "name": "スプラスピナーPYTN",
   "type": "スピナー",
   "sub": "ジャンプビーコン",
   "special": "ウルトラショット"
 },
 {
   "name": "フィンセントBRNZ",
   "type": "フデ",
   "sub": "スプラッシュシールド",
   "special": "ウルトラショット"
 },
 {
   "name": "ドライブワイパーRUST",
   "type": "ワイパー",
   "sub": "カーリングボム",
   "special": "ウルトラショット"
 }
];
const shoot51 = [
{
   "name": "R-PEN/5H",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "H3リールガン",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "エナジースタンド"
},
{
   "name": "イグザミナー",
   "type": "スピナー",
   "sub": "カーリングボム",
   "special": "エナジースタンド"
},
{
   "name": "ダイナモローラー",
   "type": "ローラー",
   "sub": "スプリンクラー",
   "special": "エナジースタンド"
},
{
   "name": "ヒッセン・ヒュー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "エナジースタンド"
},
{
   "name": "N-ZAP85(黒ザップ)",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
},
{
   "name": "スパッタリー(赤スパ)",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "エナジースタンド"
},
 {
   "name": ".96ガロン爪",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "エナジースタンド"
 },
 {
   "name": "RブラスターエリートWNTR",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "エナジースタンド"
 }
];
const shoot52 = [
{
   "name": "スプラマニューバー",
   "type": "マニューバー",
   "sub": "キューバンボム",
   "special": "カニタンク"
},
{
   "name": "シャープマーカー",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "カニタンク"
},
{
   "name": "イグザミナー・ヒュー",
   "type": "スピナー",
   "sub": "スプラッシュボム",
   "special": "カニタンク"
},
{
   "name": "ジムワイパー・ヒュー",
   "type": "ワイパー",
   "sub": "ポイズンミスト",
   "special": "カニタンク"
},
{
   "name": "L3リールガン",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "カニタンク"
},
{
   "name": "プライムシューター",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "カニタンク"
},
 {
   "name": "モップリン角",
   "type": "スロッシャー",
   "sub": "カーリングボム",
   "special": "カニタンク"
 },
 {
   "name": "ホットブラスター艶",
   "type": "ブラスター",
   "sub": "ジャンプビーコン",
   "special": "カニタンク"
 },
 {
   "name": "スプラチャージャーFRST or スコープ",
   "type": "チャージャー",
   "sub": "スプリンクラー",
   "special": "カニタンク"
 }
];
const shoot53 = [
{
   "name": "ワイドローラー",
   "type": "ローラー",
   "sub": "スプラッシュシールド",
   "special": "キューインキ"
},
{
   "name": "キャンピングシェルター",
   "type": "シェルター",
   "sub": "ジャンプビーコン",
   "special": "キューインキ"
},
{
   "name": ".96ガロン",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "キューインキ"
},
{
   "name": "クーゲルシュライバー・ヒュー",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "キューインキ"
},
{
   "name": "ジェットスイーパー",
   "type": "シューター",
   "sub": "ラインマーカー",
   "special": "キューインキ"
},
{
   "name": "Rブラスターエリート",
   "type": "ブラスター",
   "sub": "ポイズンミスト",
   "special": "キューインキ"
},
{
   "name": "スプラチャージャー or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュボム",
   "special": "キューインキ"
}
];
const shoot54 = [
{
   "name": "スプラローラー",
   "type": "ローラー",
   "sub": "カーリングボム",
   "special": "グレートバリア"
},
{
   "name": "スクイックリンα",
   "type": "チャージャー",
   "sub": "ポイントセンサー",
   "special": "グレートバリア"
},
{
   "name": "24式張替傘・甲",
   "type": "シェルター",
   "sub": "ラインマーカー",
   "special": "グレートバリア"
},
{
   "name": "デンタルワイパーミント",
   "type": "ワイパー",
   "sub": "キューバンボム",
   "special": "グレートバリア"
},
{
   "name": "ホットブラスター",
   "type": "ブラスター",
   "sub": "ロボットボム",
   "special": "グレートバリア"
},
{
   "name": "スプラスピナーコラボ",
   "type": "スピナー",
   "sub": "ポイズンミスト",
   "special": "グレートバリア"
},
{
   "name": "H3リールガンD",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "グレートバリア"
},
{
   "name": "わかばシューター",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "グレートバリア"
},
 {
   "name": "ハイドラント圧",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "グレートバリア"
 },
 {
   "name": "スプラマニューバー耀",
   "type": "マニューバー",
   "sub": "タンサンボム",
   "special": "グレートバリア"
 }
];
const shoot55 = [
{
   "name": "スパイガジェット",
   "type": "シェルター",
   "sub": "トラップ",
   "special": "サメライド"
},
{
   "name": "LACT-450デコ",
   "type": "ストリンガー",
   "sub": "スプラッシュシールド",
   "special": "サメライド"
},
{
   "name": "プロモデラーMG(銀モデ)",
   "type": "シューター",
   "sub": "タンサンボム",
   "special": "サメライド"
},
{
   "name": "モップリン",
   "type": "スロッシャー",
   "sub": "キューバンボム",
   "special": "サメライド"
},
{
   "name": "クアッドホッパーブラック",
   "type": "マニューバー",
   "sub": "ロボットボム",
   "special": "サメライド"
},
{
   "name": "スパッタリー・ヒュー(青スパ)",
   "type": "マニューバー",
   "sub": "トーピード",
   "special": "サメライド"
},
{
   "name": "S-BLAST92(通常)",
   "type": "ブラスター",
   "sub": "スプリンクラー",
   "special": "サメライド"
}
];
const shoot56 = [
{
   "name": "ジムワイパー",
   "type": "ワイパー",
   "sub": "クイックボム",
   "special": "ショクワンダー"
},
{
   "name": "クアッドホッパーホワイト",
   "type": "マニューバー",
   "sub": "スプリンクラー",
   "special": "ショクワンダー"
},
{
   "name": "カーボンローラー",
   "type": "ローラー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "バケットスロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "ショクワンダー"
},
{
   "name": "スクイックリンβ",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "ショクワンダー"
},
{
   "name": "ノヴァブラスター",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "ショクワンダー"
},
{
   "name": "ホクサイ",
   "type": "フデ",
   "sub": "キューバンボム",
   "special": "ショクワンダー"
}
];
const shoot57 = [
{
   "name": "もみじシューター",
   "type": "シューター",
   "sub": "トーピード",
   "special": "ホップソナー"
},
{
   "name": "リッター4K or スコープ",
   "type": "チャージャー",
   "sub": "トラップ",
   "special": "ホップソナー"
},
{
   "name": "デュアルスイーパー",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "ホップソナー"
},
{
   "name": "バレルスピナー",
   "type": "スピナー",
   "sub": "スプリンクラー",
   "special": "ホップソナー"
},
{
   "name": "ロングブラスター",
   "type": "ブラスター",
   "sub": "キューバンボム",
   "special": "ホップソナー"
},
{
   "name": "フルイドVカスタム",
   "type": "ストリンガー",
   "sub": "ポイントセンサー",
   "special": "ホップソナー"
},
{
   "name": "モップリンD",
   "type": "スロッシャー",
   "sub": "ジャンプビーコン",
   "special": "ホップソナー"
},
{
   "name": "フィンセント",
   "type": "フデ",
   "sub": "カーリングボム",
   "special": "ホップソナー"
}
];
const shoot58 = [
{
   "name": "ガエンFF",
   "type": "マニューバー",
   "sub": "トラップ",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": ".52ガロン",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "ボールドマーカーネオ",
   "type": "シューター",
   "sub": "ジャンプビーコン",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "Rブラスターエリートデコ",
   "type": "ブラスター",
   "sub": "ラインマーカー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "パブロ",
   "type": "フデ",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "14式竹筒銃・甲",
   "type": "チャージャー",
   "sub": "ロボットボム",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "スペースシューター",
   "type": "シューター",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
},
{
   "name": "トライストリンガー",
   "type": "ストリンガー",
   "sub": "ポイズンミスト",
   "special": "メガホンレーザー5.1ch"
},
 {
   "name": "ダイナモローラー冥",
   "type": "ローラー",
   "sub": "ポイントセンサー",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "スパイガジェット繚",
   "type": "シェルター",
   "sub": "カーリングボム",
   "special": "メガホンレーザー5.1ch"
 },
 {
   "name": "スパッタリーOWL",
   "type": "マニューバー",
   "sub": "スプラッシュボム",
   "special": "メガホンレーザー5.1ch"
 }
];
const shoot59 = [
{
   "name": "ロングブラスターカスタム",
   "type": "ブラスター",
   "sub": "スプラッシュボム",
   "special": "テイオウイカ"
},
{
   "name": "リッター4Kカスタム or スコープ",
   "type": "チャージャー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": "オーバーフロッシャーデコ",
   "type": "スロッシャー",
   "sub": "ラインマーカー",
   "special": "テイオウイカ"
},
{
   "name": "スプラローラーコラボ",
   "type": "ローラー",
   "sub": "ジャンプビーコン",
   "special": "テイオウイカ"
},
{
   "name": ".96ガロンデコ",
   "type": "シューター",
   "sub": "スプラッシュシールド",
   "special": "テイオウイカ"
},
{
   "name": "バレルスピナーデコ",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "テイオウイカ"
},
 {
   "name": "スプラシューター煌",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "テイオウイカ"
 },
 {
   "name": "ホクサイ彗",
   "type": "フデ",
   "sub": "ロボットボム",
   "special": "テイオウイカ"
 }
];
const shoot60 = [
{
   "name": "14式竹筒銃・乙",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
},
{
   "name": "クラッシュブラスターネオ",
   "type": "ブラスター",
   "sub": "カーリングボム",
   "special": "デコイチラシ"
},
{
   "name": "N-ZAP89(赤ザップ)",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "デコイチラシ"
},
{
   "name": "デュアルスイーパーカスタム",
   "type": "マニューバー",
   "sub": "ジャンプビーコン",
   "special": "デコイチラシ"
},
{
   "name": "トライストリンガーコラボ",
   "type": "ストリンガー",
   "sub": "スプリンクラー",
   "special": "デコイチラシ"
},
{
   "name": "ダイナモローラーテスラ",
   "type": "ローラー",
   "sub": "スプラッシュボム",
   "special": "デコイチラシ"
},
 {
   "name": "カーボンローラーANGL",
   "type": "ローラー",
   "sub": "タンサンボム",
   "special": "デコイチラシ"
 },
 {
   "name": "キャンピングシェルターCREM",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "デコイチラシ"
 }
];
const shoot61 = [
{
   "name": ".52ガロンデコ",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "スミナガシート"
},
{
   "name": "スパイガジェットソレーラ",
   "type": "シェルター",
   "sub": "トーピード",
   "special": "スミナガシート"
},
{
   "name": "ヴァリアブルローラーフォイル",
   "type": "ローラー",
   "sub": "キューバンボム",
   "special": "スミナガシート"
},
{
   "name": "ハイドラントカスタム",
   "type": "スピナー",
   "sub": "トラップ",
   "special": "スミナガシート"
},
{
   "name": "ボトルガイザーフォイル",
   "type": "シューター",
   "sub": "ロボットボム",
   "special": "スミナガシート"
},
 {
   "name": "プロモデラー彩",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "スミナガシート"
 },
 {
   "name": "デュアルスイーパー蹄",
   "type": "マニューバー",
   "sub": "ポイントセンサー",
   "special": "スミナガシート"
 },
 {
   "name": "ヒッセンASH",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "スミナガシート"
 }
];
const shoot62 = [
{
   "name": "ノーチラス47",
   "type": "スピナー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "エクスプロッシャー",
   "type": "スロッシャー",
   "sub": "ポイントセンサー",
   "special": "アメフラシ"
},
{
   "name": "R-PEN/5B",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "アメフラシ"
},
{
   "name": "ワイドローラーコラボ",
   "type": "ローラー",
   "sub": "ラインマーカー",
   "special": "アメフラシ"
},
{
   "name": "オーバーフロッシャー",
   "type": "スロッシャー",
   "sub": "スプリンクラー",
   "special": "アメフラシ"
},
{
   "name": "ジェットスイーパーカスタム",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
},
{
   "name": "ホクサイ・ヒュー",
   "type": "フデ",
   "sub": "ジャンプビーコン",
   "special": "アメフラシ"
},
 {
   "name": "シャープマーカーGECK",
   "type": "シューター",
   "sub": "ポイズンミスト",
   "special": "アメフラシ"
 }
];
const shoot63 = [
{
   "name": "スプラスピナー",
   "type": "スピナー",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ソイチューバーカスタム",
   "type": "チャージャー",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ドライブワイパー",
   "type": "ワイパー",
   "sub": "トーピード",
   "special": "ウルトラハンコ"
},
{
   "name": "パブロ・ヒュー",
   "type": "フデ",
   "sub": "トラップ",
   "special": "ウルトラハンコ"
},
{
   "name": "ボールドマーカー",
   "type": "シューター",
   "sub": "カーリングボム",
   "special": "ウルトラハンコ"
},
{
   "name": "L3リールガンD",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラハンコ"
},
{
   "name": "ノヴァブラスターネオ",
   "type": "ブラスター",
   "sub": "タンサンボム",
   "special": "ウルトラハンコ"
},
{
   "name": "フルイドV",
   "type": "ストリンガー",
   "sub": "ロボットボム",
   "special": "ウルトラハンコ"
}
];
const shoot64 = [
{
   "name": "デンタルワイパースミ",
   "type": "ワイパー",
   "sub": "スプラッシュシールド",
   "special": "ジェットパック"
},
{
   "name": "ラピッドブラスターデコ",
   "type": "ブラスター",
   "sub": "トーピード",
   "special": "ジェットパック"
},
{
   "name": "ヒッセン",
   "type": "スロッシャー",
   "sub": "ポイズンミスト",
   "special": "ジェットパック"
},
{
   "name": "クーゲルシュライバー",
   "type": "スピナー",
   "sub": "タンサンボム",
   "special": "ジェットパック"
},
{
   "name": "パラシェルターソレーラ",
   "type": "シェルター",
   "sub": "ロボットボム",
   "special": "ジェットパック"
},
{
   "name": "スペースシューターコラボ",
   "type": "シューター",
   "sub": "トラップ",
   "special": "ジェットパック"
},
 {
   "name": "L3リールガン箔",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "ジェットパック"
 },
 {
   "name": "トライストリンガー燈",
   "type": "ストリンガー",
   "sub": "ラインマーカー",
   "special": "ジェットパック"
 }
];
const shoot65 = [
{
   "name": "プロモデラーRG(金モデ)",
   "type": "シューター",
   "sub": "スプリンクラー",
   "special": "ナイスダマ"
},
{
   "name": "スクリュースロッシャー",
   "type": "スロッシャー",
   "sub": "タンサンボム",
   "special": "ナイスダマ"
},
{
   "name": "ハイドラント",
   "type": "スピナー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
},
{
   "name": "S-BLAST91(亜種)",
   "type": "ブラスター",
   "sub": "クイックボム",
   "special": "ナイスダマ"
},
{
   "name": "ケルビン525",
   "type": "マニューバー",
   "sub": "スプラッシュシールド",
   "special": "ナイスダマ"
},
{
   "name": "プライムシューターコラボ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "ナイスダマ"
},
 {
   "name": "ジムワイパー封",
   "type": "ワイパー",
   "sub": "ロボットボム",
   "special": "ナイスダマ"
 },
 {
   "name": "LACT-450MILK",
   "type": "ストリンガー",
   "sub": "トーピード",
   "special": "ナイスダマ"
 }
];
const shoot66 = [
{
   "name": "ヴァリアブルローラー",
   "type": "ローラー",
   "sub": "トラップ",
   "special": "マルチミサイル"
},
{
   "name": "ソイチューバー",
   "type": "チャージャー",
   "sub": "トーピード",
   "special": "マルチミサイル"
},
{
   "name": "フィンセント・ヒュー",
   "type": "フデ",
   "sub": "ポイントセンサー",
   "special": "マルチミサイル"
},
{
   "name": "ドライブワイパーデコ",
   "type": "ワイパー",
   "sub": "ジャンプビーコン",
   "special": "マルチミサイル"
},
{
   "name": "LACT-450",
   "type": "ストリンガー",
   "sub": "カーリングボム",
   "special": "マルチミサイル"
},
{
   "name": "プライムシューターFRZN",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "マルチミサイル"
 }
];
const shoot67 = [
{
   "name": "24式張替傘・乙",
   "type": "シェルター",
   "sub": "ポイズンミスト",
   "special": "ウルトラチャクチ"
},
{
   "name": "スプラマニューバーコラボ",
   "type": "マニューバー",
   "sub": "カーリングボム",
   "special": "ウルトラチャクチ"
},
{
   "name": "ホットブラスターカスタム",
   "type": "ブラスター",
   "sub": "ポイントセンサー",
   "special": "ウルトラチャクチ"
},
{
   "name": "エクスプロッシャーカスタム",
   "type": "スロッシャー",
   "sub": "スプラッシュシールド",
   "special": "ウルトラチャクチ"
},
{
   "name": "ノーチラス79(金ノチ)",
   "type": "スピナー",
   "sub": "キューバンボム",
   "special": "ウルトラチャクチ"
},
 {
   "name": "ワイドローラー惑",
   "type": "ローラー",
   "sub": "トーピード",
   "special": "ウルトラチャクチ"
 },
 {
   "name": "ジェットスイーパーCOBR",
   "type": "シューター",
   "sub": "クイックボム",
   "special": "ウルトラチャクチ"
 }
];
const shoot68 = [
{
   "name": "ガエンFFカスタム",
   "type": "マニューバー",
   "sub": "クイックボム",
   "special": "トリプルトルネード"
},
{
   "name": "スプラチャージャーコラボ or スコープ",
   "type": "チャージャー",
   "sub": "スプラッシュシールド",
   "special": "トリプルトルネード"
},
{
   "name": "スプラシューターコラボ",
   "type": "シューター",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "ラピッドブラスター",
   "type": "ブラスター",
   "sub": "トラップ",
   "special": "トリプルトルネード"
},
{
   "name": "シャープマーカーネオ",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
},
{
   "name": "バケットスロッシャー",
   "type": "スロッシャー",
   "sub": "スプラッシュボム",
   "special": "トリプルトルネード"
},
{
   "name": "パラシェルター",
   "type": "シェルター",
   "sub": "スプリンクラー",
   "special": "トリプルトルネード"
},
 {
   "name": "H3リールガンSNAK",
   "type": "シューター",
   "sub": "キューバンボム",
   "special": "トリプルトルネード"
 }
];
const bykicommands = [
    {
        name: '疑似ブキチ杯',
        description: 'ブキをランダムにひとつ表示します。',
    },
];


export default async(message) => {
  if (message.content === 'ブキチ杯') {
     const randomWeapon = weapons[Math.floor(Math.random() * weapons.length)];
    await message.reply({
                content: `**疑似ブキチ杯結果**\n武器名: ${randomWeapon.name}\n武器種: ${randomWeapon.type}\nサブ: ${randomWeapon.sub}\nスペシャル: ${randomWeapon.special}`,
          });
    }

  if (message.content === 'メインガチャ') {
     const randomMain = main[Math.floor(Math.random() * main.length)];
    await message.reply({
                content: `**疑似ブキチ杯(メイン)結果**\n武器名: ${randomMain.name}\n武器種: ${randomMain.type}\nサブ: ${randomMain.sub1}\nスペシャル: ${randomMain.special1}\nもしくは\n武器名: ${randomMain.name2}\n武器種: ${randomMain.type}\nサブ: ${randomMain.sub2}\nスペシャル: ${randomMain.special2}\nもしくは\n武器名: ${randomMain.name3}\n武器種: ${randomMain.type}\nサブ: ${randomMain.sub3}\nスペシャル: ${randomMain.special3}`,
          });
    }
  if (message.content === 'サブガチャ') {
     const randomSub = subli[Math.floor(Math.random() * subli.length)];
    await message.reply({
                content: `**疑似ブキチ杯(サブ)結果**\n** ${randomSub.sub}**`,
          });
    }
  if (message.content === 'スペシャルガチャ') {
     const randomSpe = speli[Math.floor(Math.random() * speli.length)];
    await message.reply({
                content: `**疑似ブキチ杯(サブ)結果**\n** ${randomSpe.special}**`,
          });
    } 
  if (message.content === '武器種ガチャ') {
     const randomwep = wepli[Math.floor(Math.random() * wepli.length)];
    await message.reply({
                content: `**疑似ブキチ杯(武器種)結果**\n** ${randomwep.type}**`,
          });
    } 
  if (message.content === 'ステージガチャ') {
     const randomsta = stali[Math.floor(Math.random() * stali.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ステージ)結果**\n** ${randomsta.stage}**`,
          });
    } 
  if (message.content === 'ルールガチャ') {
     const randomrule = ruleli[Math.floor(Math.random() * ruleli.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ルール)結果**\n** ${randomrule.rule}**`,
          });
    }
  if (message.content === 'ルールガチャ3') {
     const randomrule3 = ruleli3[Math.floor(Math.random() * ruleli3.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ルール)結果**\n** ${randomrule3.rule3}**`,
          });
    } 
  if (message.content === 'ルールガチャ4') {
     const randomrule4 = ruleli4[Math.floor(Math.random() * ruleli4.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ルール)結果**\n** ${randomrule4.rule4}**`,
          });
    }
  if (message.content === 'シューターガチャ') {
     const randomshoot01 = shoot01[Math.floor(Math.random() * shoot01.length)];
    await message.reply({
                content: `**疑似ブキチ杯(シューター)結果**\n武器名: ${randomshoot01.name}\n武器種: ${randomshoot01.type}\nサブ: ${randomshoot01.sub}\nスペシャル: ${randomshoot01.special}`,
          });
    }
  if (message.content === 'ローラーガチャ') {
     const randomshoot02 = shoot02[Math.floor(Math.random() * shoot02.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ローラー)結果**\n武器名: ${randomshoot02.name}\n武器種: ${randomshoot02.type}\nサブ: ${randomshoot02.sub}\nスペシャル: ${randomshoot02.special}`,
          });
    }
  if (message.content === 'チャージャーガチャ') {
     const randomshoot03 = shoot03[Math.floor(Math.random() * shoot03.length)];
    await message.reply({
                content: `**疑似ブキチ杯(チャージャー)結果**\n武器名: ${randomshoot03.name}\n武器種: ${randomshoot03.type}\nサブ: ${randomshoot03.sub}\nスペシャル: ${randomshoot03.special}`,
          });
    }
  if (message.content === 'スロッシャーガチャ') {
     const randomshoot04 = shoot04[Math.floor(Math.random() * shoot04.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スロッシャー)結果**\n武器名: ${randomshoot04.name}\n武器種: ${randomshoot04.type}\nサブ: ${randomshoot04.sub}\nスペシャル: ${randomshoot04.special}`,
          });
    }
  if (message.content === 'スピナーガチャ') {
     const randomshoot05 = shoot05[Math.floor(Math.random() * shoot05.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スピナー)結果**\n武器名: ${randomshoot05.name}\n武器種: ${randomshoot05.type}\nサブ: ${randomshoot05.sub}\nスペシャル: ${randomshoot05.special}`,
          });
    }
  if (message.content === 'マニューバーガチャ') {
     const randomshoot06 = shoot06[Math.floor(Math.random() * shoot06.length)];
    await message.reply({
                content: `**疑似ブキチ杯(マニューバー)結果**\n武器名: ${randomshoot06.name}\n武器種: ${randomshoot06.type}\nサブ: ${randomshoot06.sub}\nスペシャル: ${randomshoot06.special}`,
          });
    }
  if (message.content === 'シェルターガチャ') {
     const randomshoot07 = shoot07[Math.floor(Math.random() * shoot07.length)];
    await message.reply({
                content: `**疑似ブキチ杯(シェルター)結果**\n武器名: ${randomshoot07.name}\n武器種: ${randomshoot07.type}\nサブ: ${randomshoot07.sub}\nスペシャル: ${randomshoot07.special}`,
          });
    }
  if (message.content === 'ブラスターガチャ') {
     const randomshoot08 = shoot08[Math.floor(Math.random() * shoot08.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ブラスター)結果**\n武器名: ${randomshoot08.name}\n武器種: ${randomshoot08.type}\nサブ: ${randomshoot08.sub}\nスペシャル: ${randomshoot08.special}`,
          });
    }
  if (message.content === 'フデガチャ') {
     const randomshoot09 = shoot09[Math.floor(Math.random() * shoot09.length)];
    await message.reply({
                content: `**疑似ブキチ杯(フデ)結果**\n武器名: ${randomshoot09.name}\n武器種: ${randomshoot09.type}\nサブ: ${randomshoot09.sub}\nスペシャル: ${randomshoot09.special}`,
          });
    }
  if (message.content === 'ストリンガーガチャ') {
     const randomshoot10 = shoot10[Math.floor(Math.random() * shoot10.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ストリンガー)結果**\n武器名: ${randomshoot10.name}\n武器種: ${randomshoot10.type}\nサブ: ${randomshoot10.sub}\nスペシャル: ${randomshoot10.special}`,
          });
    }
  if (message.content === 'ワイパーガチャ') {
     const randomshoot11 = shoot11[Math.floor(Math.random() * shoot11.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ワイパー)結果**\n武器名: ${randomshoot11.name}\n武器種: ${randomshoot11.type}\nサブ: ${randomshoot11.sub}\nスペシャル: ${randomshoot11.special}`,
          });
    }
  if (message.content === '短距離ガチャ') {
     const randomshoot20 = shoot20[Math.floor(Math.random() * shoot20.length)];
    await message.reply({
                content: `**疑似ブキチ杯(短距離)結果**\n武器名: ${randomshoot20.name}\n武器種: ${randomshoot20.type}\nサブ: ${randomshoot20.sub}\nスペシャル: ${randomshoot20.special}`,
          });
    }
  if (message.content === '中距離ガチャ') {
     const randomshoot21 = shoot21[Math.floor(Math.random() * shoot21.length)];
    await message.reply({
                content: `**疑似ブキチ杯(中距離)結果**\n武器名: ${randomshoot21.name}\n武器種: ${randomshoot21.type}\nサブ: ${randomshoot21.sub}\nスペシャル: ${randomshoot21.special}`,
          });
    }
  if (message.content === '長距離ガチャ') {
     const randomshoot22 = shoot22[Math.floor(Math.random() * shoot22.length)];
    await message.reply({
                content: `**疑似ブキチ杯(長距離)結果**\n武器名: ${randomshoot22.name}\n武器種: ${randomshoot22.type}\nサブ: ${randomshoot22.sub}\nスペシャル: ${randomshoot22.special}`,
          });
    }
  if (message.content === '短距離チャージャーガチャ') {
     const randomshoot23 = shoot23[Math.floor(Math.random() * shoot23.length)];
    await message.reply({
                content: `**疑似ブキチ杯(短距離チャージャー)結果**\n武器名: ${randomshoot23.name}\n武器種: ${randomshoot23.type}\nサブ: ${randomshoot23.sub}\nスペシャル: ${randomshoot23.special}`,
          });
    }
  if (message.content === '長距離チャージャーガチャ') {
     const randomshoot24 = shoot24[Math.floor(Math.random() * shoot24.length)];
    await message.reply({
                content: `**疑似ブキチ杯(長距離チャージャー)結果**\n武器名: ${randomshoot24.name}\n武器種: ${randomshoot24.type}\nサブ: ${randomshoot24.sub}\nスペシャル: ${randomshoot24.special}`,
          });
    }
  if (message.content === 'スプボガチャ') {
     const randomshoot30 = shoot30[Math.floor(Math.random() * shoot30.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スプラッシュボム)結果**\n武器名: ${randomshoot30.name}\n武器種: ${randomshoot30.type}\nサブ: ${randomshoot30.sub}\nスペシャル: ${randomshoot30.special}`,
          });
    }  
    if (message.content === 'スプラッシュボムガチャ') {
     const randomshoot30 = shoot30[Math.floor(Math.random() * shoot30.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スプラッシュボム)結果**\n武器名: ${randomshoot30.name}\n武器種: ${randomshoot30.type}\nサブ: ${randomshoot30.sub}\nスペシャル: ${randomshoot30.special}`,
          });
    }  
  if (message.content === 'キューバンガチャ') {
     const randomshoot31 = shoot31[Math.floor(Math.random() * shoot31.length)];
    await message.reply({
                content: `**疑似ブキチ杯(キューバンボム)結果**\n武器名: ${randomshoot31.name}\n武器種: ${randomshoot31.type}\nサブ: ${randomshoot31.sub}\nスペシャル: ${randomshoot31.special}`,
          });
    }  
    if (message.content === 'キューバンボムガチャ') {
     const randomshoot31 = shoot31[Math.floor(Math.random() * shoot31.length)];
    await message.reply({
                content: `**疑似ブキチ杯(キューバンボム)結果**\n武器名: ${randomshoot31.name}\n武器種: ${randomshoot31.type}\nサブ: ${randomshoot31.sub}\nスペシャル: ${randomshoot31.special}`,
          });
    }  
  if (message.content === 'クイボガチャ') {
     const randomshoot32 = shoot32[Math.floor(Math.random() * shoot32.length)];
    await message.reply({
                content: `**疑似ブキチ杯(クイックボム)結果**\n武器名: ${randomshoot32.name}\n武器種: ${randomshoot32.type}\nサブ: ${randomshoot32.sub}\nスペシャル: ${randomshoot32.special}`,
          });
    }  
    if (message.content === 'クイックボムガチャ') {
     const randomshoot32 = shoot32[Math.floor(Math.random() * shoot32.length)];
    await message.reply({
                content: `**疑似ブキチ杯(クイックボム)結果**\n武器名: ${randomshoot32.name}\n武器種: ${randomshoot32.type}\nサブ: ${randomshoot32.sub}\nスペシャル: ${randomshoot32.special}`,
          });
    } 
  if (message.content === 'スプリンクラーガチャ') {
     const randomshoot33 = shoot33[Math.floor(Math.random() * shoot33.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スプリンクラー)結果**\n武器名: ${randomshoot33.name}\n武器種: ${randomshoot33.type}\nサブ: ${randomshoot33.sub}\nスペシャル: ${randomshoot33.special}`,
          });
    }  
  if (message.content === 'シールドガチャ') {
     const randomshoot34 = shoot34[Math.floor(Math.random() * shoot34.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スプラッシュシールド)結果**\n武器名: ${randomshoot34.name}\n武器種: ${randomshoot34.type}\nサブ: ${randomshoot34.sub}\nスペシャル: ${randomshoot34.special}`,
          });
    }  
    if (message.content === 'スプラッシュシールドガチャ') {
     const randomshoot34 = shoot34[Math.floor(Math.random() * shoot34.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スプラッシュシールド)結果**\n武器名: ${randomshoot34.name}\n武器種: ${randomshoot34.type}\nサブ: ${randomshoot34.sub}\nスペシャル: ${randomshoot34.special}`,
          });
    }  
  if (message.content === 'タンサンガチャ') {
     const randomshoot35 = shoot35[Math.floor(Math.random() * shoot35.length)];
    await message.reply({
                content: `**疑似ブキチ杯(タンサンボム)結果**\n武器名: ${randomshoot35.name}\n武器種: ${randomshoot35.type}\nサブ: ${randomshoot35.sub}\nスペシャル: ${randomshoot35.special}`,
          });
    }  
    if (message.content === 'タンサンボムガチャ') {
     const randomshoot35 = shoot35[Math.floor(Math.random() * shoot35.length)];
    await message.reply({
                content: `**疑似ブキチ杯(タンサンボム)結果**\n武器名: ${randomshoot35.name}\n武器種: ${randomshoot35.type}\nサブ: ${randomshoot35.sub}\nスペシャル: ${randomshoot35.special}`,
          });
    }  
  if (message.content === 'カーリングガチャ') {
     const randomshoot36 = shoot36[Math.floor(Math.random() * shoot36.length)];
    await message.reply({
                content: `**疑似ブキチ杯(カーリングボム)結果**\n武器名: ${randomshoot36.name}\n武器種: ${randomshoot36.type}\nサブ: ${randomshoot36.sub}\nスペシャル: ${randomshoot36.special}`,
          });
    }  
   if (message.content === 'カーリングボムガチャ') {
     const randomshoot36 = shoot36[Math.floor(Math.random() * shoot36.length)];
    await message.reply({
                content: `**疑似ブキチ杯(カーリングボム)結果**\n武器名: ${randomshoot36.name}\n武器種: ${randomshoot36.type}\nサブ: ${randomshoot36.sub}\nスペシャル: ${randomshoot36.special}`,
          });
    }  
  if (message.content === 'ロボボムガチャ') {
     const randomshoot37 = shoot37[Math.floor(Math.random() * shoot37.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ロボットボム)結果**\n武器名: ${randomshoot37.name}\n武器種: ${randomshoot37.type}\nサブ: ${randomshoot37.sub}\nスペシャル: ${randomshoot37.special}`,
          });
    }  
    if (message.content === 'ロボットボムガチャ') {
     const randomshoot37 = shoot37[Math.floor(Math.random() * shoot37.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ロボットボム)結果**\n武器名: ${randomshoot37.name}\n武器種: ${randomshoot37.type}\nサブ: ${randomshoot37.sub}\nスペシャル: ${randomshoot37.special}`,
          });
    }  
  if (message.content === 'ビーコンガチャ') {
     const randomshoot38 = shoot38[Math.floor(Math.random() * shoot38.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ジャンプビーコン)結果**\n武器名: ${randomshoot38.name}\n武器種: ${randomshoot38.type}\nサブ: ${randomshoot38.sub}\nスペシャル: ${randomshoot38.special}`,
          });
    }  
    if (message.content === 'ジャンプビーコンガチャ') {
     const randomshoot38 = shoot38[Math.floor(Math.random() * shoot38.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ジャンプビーコン)結果**\n武器名: ${randomshoot38.name}\n武器種: ${randomshoot38.type}\nサブ: ${randomshoot38.sub}\nスペシャル: ${randomshoot38.special}`,
          });
    }  
  if (message.content === 'ポイセンガチャ') {
     const randomshoot39 = shoot39[Math.floor(Math.random() * shoot39.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ポイントセンサー)結果**\n武器名: ${randomshoot39.name}\n武器種: ${randomshoot39.type}\nサブ: ${randomshoot39.sub}\nスペシャル: ${randomshoot39.special}`,
          });
    }  
    if (message.content === 'ポイントセンサーガチャ') {
     const randomshoot39 = shoot39[Math.floor(Math.random() * shoot39.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ポイントセンサー)結果**\n武器名: ${randomshoot39.name}\n武器種: ${randomshoot39.type}\nサブ: ${randomshoot39.sub}\nスペシャル: ${randomshoot39.special}`,
          });
    }  
  if (message.content === 'トラップガチャ') {
     const randomshoot40 = shoot40[Math.floor(Math.random() * shoot40.length)];
    await message.reply({
                content: `**疑似ブキチ杯(トラップ)結果**\n武器名: ${randomshoot40.name}\n武器種: ${randomshoot40.type}\nサブ: ${randomshoot40.sub}\nスペシャル: ${randomshoot40.special}`,
          });
    }  
  if (message.content === 'ポイズンガチャ') {
     const randomshoot41 = shoot41[Math.floor(Math.random() * shoot41.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ポイズンミスト)結果**\n武器名: ${randomshoot41.name}\n武器種: ${randomshoot41.type}\nサブ: ${randomshoot41.sub}\nスペシャル: ${randomshoot41.special}`,
          });
    }  
    if (message.content === 'ポイズンミストガチャ') {
     const randomshoot41 = shoot41[Math.floor(Math.random() * shoot41.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ポイズンミスト)結果**\n武器名: ${randomshoot41.name}\n武器種: ${randomshoot41.type}\nサブ: ${randomshoot41.sub}\nスペシャル: ${randomshoot41.special}`,
          });
    } 
  if (message.content === 'ラインマーカーガチャ') {
     const randomshoot42 = shoot42[Math.floor(Math.random() * shoot42.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ラインマーカー)結果**\n武器名: ${randomshoot42.name}\n武器種: ${randomshoot42.type}\nサブ: ${randomshoot42.sub}\nスペシャル: ${randomshoot42.special}`,
          });
    }  
  if (message.content === 'トーピードガチャ') {
     const randomshoot43 = shoot43[Math.floor(Math.random() * shoot43.length)];
    await message.reply({
                content: `**疑似ブキチ杯(トーピード)結果**\n武器名: ${randomshoot43.name}\n武器種: ${randomshoot43.type}\nサブ: ${randomshoot43.sub}\nスペシャル: ${randomshoot43.special}`,
          });
    }  
  if (message.content === 'ウルショガチャ') {
     const randomshoot50 = shoot50[Math.floor(Math.random() * shoot50.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ウルトラショット)結果**\n武器名: ${randomshoot50.name}\n武器種: ${randomshoot50.type}\nサブ: ${randomshoot50.sub}\nスペシャル: ${randomshoot50.special}`,
          });
    }  
    if (message.content === 'ウルトラショットガチャ') {
     const randomshoot50 = shoot50[Math.floor(Math.random() * shoot50.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ウルトラショット)結果**\n武器名: ${randomshoot50.name}\n武器種: ${randomshoot50.type}\nサブ: ${randomshoot50.sub}\nスペシャル: ${randomshoot50.special}`,
          });
    }  
  if (message.content === 'エナスタガチャ') {
     const randomshoot51 = shoot51[Math.floor(Math.random() * shoot51.length)];
    await message.reply({
                content: `**疑似ブキチ杯(エナジースタンド)結果**\n武器名: ${randomshoot51.name}\n武器種: ${randomshoot51.type}\nサブ: ${randomshoot51.sub}\nスペシャル: ${randomshoot51.special}`,
          });
    }  
    if (message.content === 'エナジースタンドガチャ') {
     const randomshoot51 = shoot51[Math.floor(Math.random() * shoot51.length)];
    await message.reply({
                content: `**疑似ブキチ杯(エナジースタンド)結果**\n武器名: ${randomshoot51.name}\n武器種: ${randomshoot51.type}\nサブ: ${randomshoot51.sub}\nスペシャル: ${randomshoot51.special}`,
          });
    }  
  if (message.content === 'カニタンクガチャ') {
     const randomshoot52 = shoot52[Math.floor(Math.random() * shoot52.length)];
    await message.reply({
                content: `**疑似ブキチ杯(カニタンク)結果**\n武器名: ${randomshoot52.name}\n武器種: ${randomshoot52.type}\nサブ: ${randomshoot52.sub}\nスペシャル: ${randomshoot52.special}`,
          });
    }  
  if (message.content === 'キューインキガチャ') {
     const randomshoot53 = shoot53[Math.floor(Math.random() * shoot53.length)];
    await message.reply({
                content: `**疑似ブキチ杯(キューインキ)結果**\n武器名: ${randomshoot53.name}\n武器種: ${randomshoot53.type}\nサブ: ${randomshoot53.sub}\nスペシャル: ${randomshoot53.special}`,
          });
    }  
  if (message.content === 'グレバリガチャ') {
     const randomshoot54 = shoot54[Math.floor(Math.random() * shoot54.length)];
    await message.reply({
                content: `**疑似ブキチ杯(グレートバリア)結果**\n武器名: ${randomshoot54.name}\n武器種: ${randomshoot54.type}\nサブ: ${randomshoot54.sub}\nスペシャル: ${randomshoot54.special}`,
          });
    }  
    if (message.content === 'グレートバリアガチャ') {
     const randomshoot54 = shoot54[Math.floor(Math.random() * shoot54.length)];
    await message.reply({
                content: `**疑似ブキチ杯(グレートバリア)結果**\n武器名: ${randomshoot54.name}\n武器種: ${randomshoot54.type}\nサブ: ${randomshoot54.sub}\nスペシャル: ${randomshoot54.special}`,
          });
    }  
  if (message.content === 'サメライドガチャ') {
     const randomshoot55 = shoot55[Math.floor(Math.random() * shoot55.length)];
    await message.reply({
                content: `**疑似ブキチ杯(サメライド)結果**\n武器名: ${randomshoot55.name}\n武器種: ${randomshoot55.type}\nサブ: ${randomshoot55.sub}\nスペシャル: ${randomshoot55.special}`,
          });
    }  
  if (message.content === 'ショクワンガチャ') {
     const randomshoot56 = shoot56[Math.floor(Math.random() * shoot56.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ショクワンダー)結果**\n武器名: ${randomshoot56.name}\n武器種: ${randomshoot56.type}\nサブ: ${randomshoot56.sub}\nスペシャル: ${randomshoot56.special}`,
          });
    }  
    if (message.content === 'ショクワンダーガチャ') {
     const randomshoot56 = shoot56[Math.floor(Math.random() * shoot56.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ショクワンダー)結果**\n武器名: ${randomshoot56.name}\n武器種: ${randomshoot56.type}\nサブ: ${randomshoot56.sub}\nスペシャル: ${randomshoot56.special}`,
          });
    }  
  if (message.content === 'ホップソナーガチャ') {
     const randomshoot57 = shoot57[Math.floor(Math.random() * shoot57.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ホップソナー)結果**\n武器名: ${randomshoot57.name}\n武器種: ${randomshoot57.type}\nサブ: ${randomshoot57.sub}\nスペシャル: ${randomshoot57.special}`,
          });
    }  
  if (message.content === 'メガホンガチャ') {
     const randomshoot58 = shoot58[Math.floor(Math.random() * shoot58.length)];
    await message.reply({
                content: `**疑似ブキチ杯(メガホンレーザー5.1ch)結果**\n武器名: ${randomshoot58.name}\n武器種: ${randomshoot58.type}\nサブ: ${randomshoot58.sub}\nスペシャル: ${randomshoot58.special}`,
          });
    }  
    if (message.content === 'メガホンレーザーガチャ') {
     const randomshoot58 = shoot58[Math.floor(Math.random() * shoot58.length)];
    await message.reply({
                content: `**疑似ブキチ杯(メガホンレーザー5.1ch)結果**\n武器名: ${randomshoot58.name}\n武器種: ${randomshoot58.type}\nサブ: ${randomshoot58.sub}\nスペシャル: ${randomshoot58.special}`,
          });
    }  
  if (message.content === 'テイオウガチャ') {
     const randomshoot59 = shoot59[Math.floor(Math.random() * shoot59.length)];
    await message.reply({
                content: `**疑似ブキチ杯(テイオウイカ)結果**\n武器名: ${randomshoot59.name}\n武器種: ${randomshoot59.type}\nサブ: ${randomshoot59.sub}\nスペシャル: ${randomshoot59.special}`,
          });
    }  
  if (message.content === 'デコイチラシガチャ') {
     const randomshoot60 = shoot60[Math.floor(Math.random() * shoot60.length)];
    await message.reply({
                content: `**疑似ブキチ杯(デコイチラシ)結果**\n武器名: ${randomshoot60.name}\n武器種: ${randomshoot60.type}\nサブ: ${randomshoot60.sub}\nスペシャル: ${randomshoot60.special}`,
          });
    }  
  if (message.content === 'スミナガガチャ') {
     const randomshoot61 = shoot61[Math.floor(Math.random() * shoot61.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スミナガシート)結果**\n武器名: ${randomshoot61.name}\n武器種: ${randomshoot61.type}\nサブ: ${randomshoot61.sub}\nスペシャル: ${randomshoot61.special}`,
          });
    }  
    if (message.content === 'スミナガシートガチャ') {
     const randomshoot61 = shoot61[Math.floor(Math.random() * shoot61.length)];
    await message.reply({
                content: `**疑似ブキチ杯(スミナガシート)結果**\n武器名: ${randomshoot61.name}\n武器種: ${randomshoot61.type}\nサブ: ${randomshoot61.sub}\nスペシャル: ${randomshoot61.special}`,
          });
    }  
  if (message.content === 'アメフラシガチャ') {
     const randomshoot62 = shoot62[Math.floor(Math.random() * shoot62.length)];
    await message.reply({
                content: `**疑似ブキチ杯(アメフラシ)結果**\n武器名: ${randomshoot62.name}\n武器種: ${randomshoot62.type}\nサブ: ${randomshoot62.sub}\nスペシャル: ${randomshoot62.special}`,
          });
    }  
  if (message.content === 'ウルハンガチャ') {
     const randomshoot63 = shoot63[Math.floor(Math.random() * shoot63.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ウルトラハンコ)結果**\n武器名: ${randomshoot63.name}\n武器種: ${randomshoot63.type}\nサブ: ${randomshoot63.sub}\nスペシャル: ${randomshoot63.special}`,
          });
    }  
   if (message.content === 'ウルトラハンコガチャ') {
     const randomshoot63 = shoot63[Math.floor(Math.random() * shoot63.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ウルトラハンコ)結果**\n武器名: ${randomshoot63.name}\n武器種: ${randomshoot63.type}\nサブ: ${randomshoot63.sub}\nスペシャル: ${randomshoot63.special}`,
          });
    }  
  if (message.content === 'ジェッパガチャ') {
     const randomshoot64 = shoot64[Math.floor(Math.random() * shoot64.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ジェットパック)結果**\n武器名: ${randomshoot64.name}\n武器種: ${randomshoot64.type}\nサブ: ${randomshoot64.sub}\nスペシャル: ${randomshoot64.special}`,
          });
    }  
    if (message.content === 'ジェットパックガチャ') {
     const randomshoot64 = shoot64[Math.floor(Math.random() * shoot64.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ジェットパック)結果**\n武器名: ${randomshoot64.name}\n武器種: ${randomshoot64.type}\nサブ: ${randomshoot64.sub}\nスペシャル: ${randomshoot64.special}`,
          });
    }  
  if (message.content === 'ナイスダマガチャ') {
     const randomshoot65 = shoot65[Math.floor(Math.random() * shoot65.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ナイスダマ)結果**\n武器名: ${randomshoot65.name}\n武器種: ${randomshoot65.type}\nサブ: ${randomshoot65.sub}\nスペシャル: ${randomshoot65.special}`,
          });
    }  
  if (message.content === 'マルミサガチャ') {
     const randomshoot66 = shoot66[Math.floor(Math.random() * shoot66.length)];
    await message.reply({
                content: `**疑似ブキチ杯(マルチミサイル)結果**\n武器名: ${randomshoot66.name}\n武器種: ${randomshoot66.type}\nサブ: ${randomshoot66.sub}\nスペシャル: ${randomshoot66.special}`,
          });
    }  
   if (message.content === 'マルチミサイルガチャ') {
     const randomshoot66 = shoot66[Math.floor(Math.random() * shoot66.length)];
    await message.reply({
                content: `**疑似ブキチ杯(マルチミサイル)結果**\n武器名: ${randomshoot66.name}\n武器種: ${randomshoot66.type}\nサブ: ${randomshoot66.sub}\nスペシャル: ${randomshoot66.special}`,
          });
    }  
  if (message.content === 'ウルチャクガチャ') {
     const randomshoot67 = shoot67[Math.floor(Math.random() * shoot67.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ウルトラチャクチ)結果**\n武器名: ${randomshoot67.name}\n武器種: ${randomshoot67.type}\nサブ: ${randomshoot67.sub}\nスペシャル: ${randomshoot67.special}`,
          });
    }  
    if (message.content === 'ウルトラチャクチガチャ') {
     const randomshoot67 = shoot67[Math.floor(Math.random() * shoot67.length)];
    await message.reply({
                content: `**疑似ブキチ杯(ウルトラチャクチ)結果**\n武器名: ${randomshoot67.name}\n武器種: ${randomshoot67.type}\nサブ: ${randomshoot67.sub}\nスペシャル: ${randomshoot67.special}`,
          });
    }  
  if (message.content === 'トルネードガチャ') {
     const randomshoot68 = shoot68[Math.floor(Math.random() * shoot68.length)];
    await message.reply({
                content: `**疑似ブキチ杯(トリプルトルネード)結果**\n武器名: ${randomshoot68.name}\n武器種: ${randomshoot68.type}\nサブ: ${randomshoot68.sub}\nスペシャル: ${randomshoot68.special}`,
          });
    }  
  if (message.content === 'トリプルトルネードガチャ') {
     const randomshoot68 = shoot68[Math.floor(Math.random() * shoot68.length)];
    await message.reply({
                content: `**疑似ブキチ杯(トリプルトルネード)結果**\n武器名: ${randomshoot68.name}\n武器種: ${randomshoot68.type}\nサブ: ${randomshoot68.sub}\nスペシャル: ${randomshoot68.special}`,
          });
    } 
    if (message.content === 'ダメライドガチャ') {
    await message.reply({
                content: `:rage:`,
          });
    } 
  
  if (message.content.match(/^\d+d\d+$/)) {
    await message.reply(ndnDice(message.content));
  }
};
